/** 卦象 */
export default [
  "【混沌初开，乾坤乃定。日月合璧，鸾凰合鸣】二等上平签",
  "【苍蝇之飞，不过数步。附于骥尾，则腾千里】四等中平签",
  "【莫言多，莫行过，总是千伶百俐，不如一推二磨】六等下平签",
  "【绝妙绝妙。云无心以出岫，鸟倦飞而归巢。花艳艳鱼跃跃。几般佳景，梦想不到】一等上上签",
  "【绿水因风而皱面，青山为雪白头。诸般皆是天造就，世上谁能强求】三等中中签",
  "【不教盘算，偏要盘算。直算得三尺肠闲着二尺半，儿童拍手笑，父老白眼看。烦烦烦】七等下下签",
  "【船到江心补漏，马到临崖收缰，鸟入笼中跃跃，鱼在网中洋洋】七等下下签",
  "【不是有心胜景，何必踏雪寻梅，孜孜乘兴而往，怏怏俯首而回】七等下下签",
  "【精细内在，当此时胡涂，即便买卖已得，自今后经纪休夸】六等下平签",
  "【莫欢莫乐。成而复破。总让尔尽心竭力，寸土不足堵黄河】六等下平签",
  "【风兼影，莫乱扑，究竟费尽功夫，慎终乃虑后，祸福不单孤】六等下平签",
  "【打草惊蛇，敲山震虎。以待蛇窜虎扑，唯恐无所措手足】七等下下签",
  "【物各有主，且须消停，雪里埋尸，久而自明】七等下下签",
  "【狐假虎威，狗仗人势。弄到其间，尽是无益】七等下下签",
  "【以蠡测海，坐井观天。虽有见识，亦是枉然】七等下下签",
  "【燕巢幕上，魚游釜中，眼前得地，脑后生风】七等下下签",
  "【得陇望蜀，得鱼忘筌。天长日久，人憎狗嫌】七等下下签",
  "【鼯鼠黔驴。有技有能，考其实际，能有技净】七等下下签",
  "【奇奇海市，妙妙蜃楼。一派佳景，却在浪头】七等下下签",
  "【乌云遮日，黑猪渡河。青山濛濛，细观楼阁】六等下平签",
  "【雪水烹茶，桂花煮酒。一般清味，恐难到口】四等中平签",
  "【虚而复实，实而却虚。木头产耳，窦里生鱼】四等中平签",
  "【可叹可怜，物却有限。听之不闻，视而不见】七等下下签",
  "【栉风沐雨，戴月披星。何时可歇，直到三更】七等下下签",
  "【蛙鼓惊梦，虹弓东斜。蜻蜓飞舞，蝴蝶穿花】六等下平签",
  "【红日遮天，绿波盖地。鱼船稳坐，长线自持】一等上上签",
  "【伐柯伐柯，顺少逆多。纵有神艺，亦未如何】六等下平签",
  "【灯油耗尽，漏声滴彻。一声鸡鸣，逍遥自歇】七等下下签",
  "【难矣哉】六等下平签",
  "【山不在高，有仙则名。水不在深，有龙则灵】四等中平签",
  "【万朵红云连王府，一轮明月照前川】一等上上签",
  "【白玉楼中吹玉笛，红梅阁上落梅花】一等上上签",
  "【椿萱并茂，兰玉联芳】一等上上签",
  "【雪束树净，月落楼空】七等下下签",
  "【一木焉能支大厦】七等下下签",
  "【玉燕投怀】三等中中签",
  "【莫轻狂，细端详，好鸟枝头皆朋友。落花水面亦文章】四等中平签",
  "【棘闱难彻】六等下平签",
  "【须慎言慎行，恐孤掌难鸣】六等下平签",
  "【鲋鱼只得西江水，霹雳一声到九天】一等上上签",
  "【两手劈开名利路，一肩挑尽落阳春】一等上上签",
  "【莫气赌、莫气赌，虽有长鞭，不及马腹】七等下下签",
  "【盲人骑瞎马，夜半临深池】七等下下签",
  "【好好好迭加三连好】一等上上签",
  "【冯唐易老，李广难封】七等下下签",
  "【天覆地载，万物仰赖，鹤鸣九皋，声闻云外】三等中中签",
  "【左右运转，前后推从，夫人不言，言必有中】四等中平签",
  "【水中之月，镜中之花。几般幻景，落在谁家】六等下平签",
  "【海不扬波，风不鸣条，雪飞六出，半空飘遥】四等中平签",
  "【秋风有意残杨柳，冷露无声老桂花】 三等中中签",
  "【梅老偏能耐雪冷，菊残却有傲霜枝】 四等中平签",
  "【能忍可无碍】四等中平签",
  "【一心白雪阳春曲，两袖清风明月秋】三等中中签",
  "【难难难，迭加三连难】七等下下签",
  "【两个黄鹂鸣翠柳，一行白鹭上青天】四等中平签",
  "【春雨发生千野绿，秋风刮去一天香】四等中平签",
  "【昨夜花残犹未落。今朝露湿又重开】四等中平签",
  "【好种红梅开喜笑。乐哉绿竹报平安】四等中平签",
  "【一朵红云惊乌鸦，半天残月映残花】三等中中签",
  "【九天日月开昌运，万里风云起壮图】一等上上签",
  "【方离发福生财地，又入堆金积玉门】七等下下签",
  "【须放开肚皮吃饭，要踮定脚跟为人】三等中中签",
  "【进一步门庭，添十分春色】一等上上签",
  "【春风拂弱柳，细雨润新苗】三等中中签",
  "【莫作愧心事，不怕鬼叫门】三等中中签",
  "【可也】四等中平签",
  "【成事不足，败事有余】七等下下签",
  "【割鸡之事，焉用牛刀】四等中平签",
  "【维鹊有巢，维鸠居之】六等下平签",
  "【琼浆润口，甘露滋心】四等中平签",
  "【星移斗转，去旧换新】二等上平签",
  "【不入虎穴，焉得虎子】四等中平签",
  "【鹬蚌相争，渔翁得利】四等中平签",
  "【凤毛济美，麟趾呈祥】四等中平签",
  "【芝兰竞秀，玉树生香】二等上平签",
  "【不危不险，去而复返】五等平平签",
  "【太阿倒持，於谁有益】六等下平签",
  "【春暖鱼跃，秋高鹿鸣】四等中平签",
  "【傍虎吃食，有损无益】六等下平签",
  "【树欲静而风不止】六等下平签",
  "【蜻蜓飞舞在池塘】五等平平签",
  "【伐倒大树有柴烧】四等中平签",
  "【眼看明月落人家】六等下平签",
  "【正遇双星渡鹊桥】四等中平签",
  "【有想宾朋朱衣乐，现思故乡红豆生】三等中中签",
  "【一条明路，直达青天。半途而废，可叹可怜】六等下平签",
  "【执柯伐柯，则远不多，不费手足，更无风波】四等中平签",
  "【闲时赏月，忙里跑风，弄到其毕，内净外空】六等下平签",
  "【仰赖天地，何必曰利，只须勤俭，胜似贸易】 四等中平签",
  "【浮生若梦，不用妄贪。知足常乐，能忍则安】五等平平签",
  "【江水洗心，明月照肝，征南战北，不难不难】五等平平签",
  "【好好好好，一了百了，不啻雷惊，何殊风扫】五等平平签",
  "【离而复合，成而必破，再费唇舌，亦未如何】二等上平签",
  "【前门拒虎，后门进狼。慎之慎之，切勿妄强】六等下平签",
  "【不怕风波于世上，便无冰炭在胸中】六等下平签",
  "【莫惆怅，莫惆怅，命里八尺，难求一丈】六等下平签",
  "【闲里自夸金屋好，梦中不觉玉山颓】六等下平签",
  "【猛虎斗，飞龙争，水落石出，草木皆兵】 七等下下签",
  "【落花流水杳然去，大有文章尽属虚】七等下下签",
  "【一樽美酒倾野荒野，两袖清风扫故土】四等中平签",
  "【知足方能图快乐，吃亏才是发财源】四等中平签",
  "【苦雨催残桃李色，凄风吹折杨柳枝】六等下平签",
  "【发财臻极宜先退，得意至浓便好休】四等中平签",
  "【灯花报捷喜鹊叫，燕子双双返故巢】六等下平签",
  "【风中烛，草上霜，虽耀耀，不久长】三等中中签",
  "【桃红复含渭雨，柳绿更带朝烟】七等下下签",
  "【鼎折足，舆脱辐，日过午，风吹烛】六等下平签",
  "【小心哉，莫务外，一步错，百步歪】六等下平签",
  "【桃李争春色，春去桃李撤】七等下下签",
  "【为山九仞，功亏一篑】六等下平签",
  "【先如山倒，后如抽丝】四等中平签",
  "【失之东隅，收之桑榆】四等中平签",
  "【刻鹄类骛，画虎成犬】六等下平签",
  "【红梅结子，绿竹生孙】三等中中签",
  "【前车之覆，后车之鉴】三等中中签",
  "【获罪于天，无所祷也】六等下平签",
  "【半途而废，令人落泪】七等下下签",
  "【朝琢夕磨，其命如何】六等下平签",
  "【命该如此，不可妄想】六等下平签",
  "【精卫衔石，枉劳心机】六等下平签",
  "【于心难忍，于心难安】七等下下签",
  "【事不干己，何必着意】五等平平签",
  "【求则得之，舍则失之】四等中平签",
  "【管中窥豹，井底观天】六等下平签",
  "【即知如此，何必如此】五等平平签",
  "【知道莫影，却来问谁】五等平平签",
  "【螮蝀在东，莫之敢指】六等下平签",
  "【拨开墨雾见青天】四等中平签",
  "【丸泥可以封函关】四等中平签",
  "【花开能有几时红】四等中平签",
  "【同心合意步云梯】四等中平签",
  "【一杆明月钓秋风】四等中平签",
  "【掌上明珠粪土埋】六等下平签",
  "【池上如今有凤毛】四等中平签",
  "【麟趾春深步玉堂】三等中中签",
  "【越鹤焉能孵鸪卵】六等下平签",
  "【莺鸠竟敢笑大鹏】四等中平签",
  "【青草池塘处处蛙】一等上上签",
  "【鸟兽不可与同群】五等平平签",
  "【青蚨飞去复飞来】五等平平签",
  "【柳暗花明别有天】五等平平签",
  "【双斧伐孤树，未有不颠仆者】七等下下签",
  "【千章刺腹】七等下下签",
  "【百酸搅肠】七等下下签",
  "【寸步难行】七等下下签",
  "【痴心妄想】七等下下签",
  "【船翻洋沟】七等下下签",
  "【青云得步】一等上上签",
  "【蜀道之难，难于上青天】七等下下签",
  "【莫轻狂，须度量，好鸟枝头亦朋友，落花水面亦文章】三等中中签",
  "【人为万物灵，鬼为万物精，灵而弄精，精而弄灵】三等中中签",
  "【堪愁堪忧，大被蒙头，睡而复醒，醒而云游】三等中中签",
  "【穷通有命，富贵在天，南颠北跑，尽是枉然】六等下平签",
  "【螟螣蟊贼，陡生四野。遏之不尽，去之不得】六等下平签",
  "【参居于西，商居于东，虽有方位，永不相逢】六等下平签",
  "【竹本无心，多生枝叶，藕虽有孔，不染垢尘】四等中平签",
  "【囊内钱空，床头金尽，身居闹市，谁肯相近】七等下下签",
  "【鸟急奔树，狗急跳墙，今逢此事，切勿转向】四等中平签",
  "【不能】六等下平签",
  "【山崩水落，草炙花燃，人人吐火，树树冒烟】七等下下签",
  "【风里燃烛，旱池钓鱼，心思虽有，名利却无】六等下平签",
  "【天之生物，因材而笃，痴心妄想，天亦难顾】七等下下签",
  "【莫喜莫喜，始终无底，差之毫厘，谬之千里】六等下平签",
  "【不揣其本，而逐其末，虽济燃眉，恐遗后祸】六等下平签",
  "【夸父逐日，杞人忧天，心小气大，利名茫然】六等下平签",
  "【刻舟求剑，剖腹藏珠，血心耿耿，利名虚虚】六等下平签",
  "【为人谋，何所图，成了赚坏骨，败了落匹夫】七等下下签",
  "【冰生于水，而寒于水，青出于蓝，而胜于蓝】七等下下签",
  "【可奈何，可奈何，中流见砥柱，平地起风波】六等下平签",
  "【淄浥之滋味宜辨，泾渭之清浊当分，以待分辨不均，惟恐其乱纷纷】五等平平签",
  "【莫强求，莫强求，一熏一莸，十年尚犹有臭】六等下平签",
  "【与效城狐社鼠，宁为陶犬瓦鸡】六等下平签",
  "【走韩庐而搏蹇兔】五等平平签",
  "【蜉蝣今夜落残花】五等平平签",
  "【鸡肋不足安尊拳】六等下平签",
  "【狗尾续貂】六等下平签",
  "【砍竹遮笋】六等下平签",
  "【罢罢罢】四等中平签",
  "【有想】四等中平签",
  "【莫望】七等下下签",
  "【即知轻重，何必叮咛，可止则止，可行则行】七等下下签",
  "【以卵击石，不自量力】七等下下签",
  "【海底捞月】七等下下签",
  "【景星入户】五等平平签",
  "【群蚁附膻】七等下下签",
  "【李生道旁】五等平平签",
  "【花发上林】四等中平签",
  "【不敢说好】六等下平签",
  "【河清海晏】三等中中签",
  "【天下太平】四等中平签",
  "【绝无所好】六等下平签",
  "【发物蒙尘】六等下平签",
  "【振枝败叶】六等下平签",
  "【一木擎天】六等下平签",
  "【破麦剖梨】六等下平签",
  "【势若摧枯】六等下平签",
  "【摧枯拉朽】七等下下签",
  "【大器晚成】五等平平签",
  "【器满必倾】七等下下签",
  "【萋斐成锦】一等上上签",
  "【城火殃鱼池】七等下下签",
  "【可厌可怜，花落庭间】七等下下签",
  "【有醴难酌，有膳难餐。有气难赌，有话难言】七等下下签",
  "【人即是鬼，鬼即是人，人曾弄鬼，鬼曾弄人】七等下下签",
  "【明知莫想，却来问我】五等平平签",
  "【即知是好，何必来占】四等中平签",
  "【得意不可再往】四等中平签",
  "【好事不如无】四等中平签",
  "【事不由己】六等下平签",
  "【谁说有成】二等上平签",
  "【无可无不可】四等中平签",
  "【自惹其祸】六等下平签",
  "【不必不必】六等下平签",
  "【上好佳】一等上上签",
  "【虽言富贵在天，穷通由命，亦须行尽人事，以由天命】五等平平签",
];

/** 解签 */
export const paraphrase = [
  {
    value: "1.混沌初开，乾坤乃定，日月和璧,凤凰合鸣。",
    explain:
      "世间万物都是新的开始，天下太平，日月为明，凤凰合鸣，是夫妻和睦之象。",
    description:
      "得此课者，往小了说一个人做什么事都会很顺心，人生非常圆满，大了说开天辟地，创立基业，光耀四海，一呼百应。",
    avoid: "无",
  },
  {
    value: "2.苍蝇之飞，不过数步，附于骥尾，则腾千里。",
    explain:
      "苍蝇只能飞很短的距离，但若附着在马尾巴上，就可以有机会到千里之外。",
    description:
      "得此课者，深入剖析，找到最适合自己的平台，选择大于努力。主个人很幸运，是金子总会闪光的。",
    avoid: "原地踏步。",
  },
  {
    value: "3.莫言多，莫行过，虽是千伶百俐,不如一推二磨。",
    explain:
      "别说太多话，别做过头事，虽然聪明伶俐，但做事还是要三思而后行，没有规矩不成方圆。最后不如不去说也不去做结果会更好一些。",
    description: "得此课者，语言行为上多加约束自己，谨言慎行。",
    avoid: "言过其实。",
  },
  {
    value:
      "4.绝妙绝妙，云无心以出岫，鸟倦飞而归巢，花艳艳，鱼跃跃，几般佳景梦想准到。",
    explain:
      "“云无心以出岫，鸟倦飞而归巢”是陶渊明的诗句，大概就是“我没有闲心思去做官、争权。天空中的鸟儿，飞累了就回家”。颇有闲云野鹤、自由自在的意味。后面跟着的是“花艳艳,鱼跃跃”。隐居之人，有这种风景陪伴，倒也是快快乐乐。总体意思就是远离世俗烦扰，过得自由自在。",
    description:
      "得此课者，居安思危，忙里偷闲，闲里吃紧，几般佳景是想要啥，就来啥。",
    avoid: "无",
  },
  {
    value: "5.绿水因风皱面，青山为雪白头，诸般皆是天造就，世上谁能强求。",
    explain: "穷通有命，富贵在天，万物造就，不可强求。",
    description:
      "得此课者，一切顺其自然，山阻石拦，大江毕竟东流去，雪辱霜欺，梅花依旧向阳开。",
    avoid: "钻牛角尖。",
  },
  {
    value:
      "6.不教盘算，偏要盘算，直算的三尺钱串闲着二尺半，儿童拍手笑，父老白眼看。",
    explain:
      "就是'聪明反被聪明误’，过度的算计最后把自己算的算没了。最后成了大众笑柄。",
    description: "得此课者，用心经营，行动起来去得到，远远要超出盘算而失去的，",
    avoid: "螳螂捕蝉黄雀在后。",
  },
  {
    value: "7.船到江心补漏迟，马到坑坎收疆晚，鸟入笼中跃跃，鱼在网里洋洋。",
    explain:
      "意思就是没做到预先计划未雨绸缪，置于险地后就什么也来不及了。不知危险反而在困境中自乐。",
    description: "得此课者，谨慎小心做事，运筹帷幄才能决胜于千里。",
    avoid: "得意忘形。",
  },
  {
    value: "8.不是赏心胜景，何必踏雪寻梅，孜孜乘兴而往，怏怏仰首而归。",
    explain: "乘兴而去，败兴而归。最后却没有收获而回。",
    description: "得此课者，行动前一定要了解清楚真伪。",
    avoid: "盲目行动。",
  },
  {
    value: "9.精细既适当，此时湖涂少使，买卖已得，自今后经济休夸。",
    explain: "过度精明算计要适当，难得糊涂，已得到好处，不要人前卖弄。",
    description: "得此课者，低调谨慎最好，财不外露。",
    avoid: "人前炫富。",
  },
  {
    value: "10.莫乐莫乐，成而复破，总让你尽心竭力，寸土不足埋黄河。",
    explain:
      "不要空欢喜，明明成功而又破，总体意思是再努力也是达不到想要的结果。",
    description: "得此课者，设定人生目标时不要盲目过于远大，量力而行。",
    avoid: "好大喜功。",
  },
  {
    value: "11.风无影，莫乱扑，究竟费工夫。慎思虑冷虑后，得饶人处且饶人。",
    explain:
      "无形无影事，浪费大量的体力精力。三思而后行。放开心态，不要与任何人过不去。",
    description: "得此课者，严谨冷静处理事情，深思熟虑后才能行动，不与人争。",
    avoid: "大事小事放不下。得理不饶人。",
  },
  {
    value: "12.打草惊蛇，敲山振虎，以待蛇鼠虎扑，唯恐无所措手足。",
    explain: "大势张扬行动，等待想要的结果，就怕到来时，来个措手不及。",
    description: "得此课者，做事要事先做好计划，盲目行动，很有可能会无法应对。",
    avoid: "泄露隐私。",
  },
  {
    value: "13.物各有主，须且消停，雪里埋尸，久而自明。",
    explain:
      "世间万物都有最终归属，物必然会有主人的，是不是自己的，到了一定的时间自然会有结果。更不要去强取别人之物，即使得到，早晚也会被人知道。",
    description:
      "得此课者，是讲不要不停地想要获得什么了，该歇歇了，而一切真相总会有大白天下的时候。是你的就是你的，不是你的你也不要强求。命里有时终须有，命里无时莫强求。",
    avoid: "贪婪，执着。",
  },
  {
    value: "14.狐假虎威，狗仗人势，弄到其间，尽是无益。",
    explain:
      "借助别人的强大，只能是暂时的得势，最后孤独没有靠山，最后对自己没有没啥好处，自己独立会避免一些无益，以诚相待才能得到更大的收益。",
    description:
      "得此课者，做任何事可以借助一些外在力量，但不要太过，低调做人，高调做事。",
    avoid: "仗势欺人，抓住不放。",
  },
  {
    value: "15.以蠡测海，坐井观天，虽有见识，亦是枉然。",
    explain:
      "蠡：这里意思是葫芦做的瓢，用葫芦瓢来测量海水，坐在井底看天。使用的方法和视野受到了严重的局限性，虽有一些见识，没有正确的方法，没有正确的定位，最后都是没有用的。",
    description: "得此课者，先衡量自己的能力所及范围，多借鉴同行业经验。",
    avoid: "闭门造车。",
  },
  {
    value: "16.燕巢幕上，鱼游釜中，眼前得地，脑后生风。",
    explain:
      "燕子把巢修在帏布上，鱼在锅里游，眼看得到的似乎是自己想要的，可是却伴随着巨大的危机。吉凶相伴之数。",
    description:
      "得此课者，所处的的环境，经营的事业前景有巨大的危机存在，早做打算避免损失。早做打算改变路线，防患未然吉。",
    avoid: "原地踏步。",
  },
  {
    value: "17.得陇望蜀，得鱼忘筌，天长日久，人憎狗嫌。",
    explain: "得寸进尺，贪心不知满足，而且成功以后忘本，搞到最后，大家都讨厌。",
    description:
      "得此课者，大多都是经营管理者者，能得到很多收益，得到后多施舍，知恩图报，事业会更上一层楼。",
    avoid: "中饱私囊，贪得无厌。",
  },
  {
    value: "18.鼯鼠黔驴，有技有能，考其实迹，能了技净。",
    explain:
      "鼯鼠和黔驴，都是和低劣的技能有关。说得是就那么一些不入流的能力，用完了这些能力，啥也没有了。知人者必先自知，治人者必先自治。",
    description: "得此课者，量力而行，多学习，增加自身能力，打铁还需自身硬。",
    avoid: "不学无术，不求上进。",
  },
  {
    value: "19.奇奇海市，妙妙蜃楼，一派佳景，却在浪头。",
    explain:
      "海市蜃楼，看得见，摸不着。看起来的美好，全都是虚的。好看是好看，却也没啥用处。",
    description:
      "得此课者，不要被表面现象蒙蔽，实际出发寻求本源，脚踏实地，必有改变。",
    avoid: "赌博。",
  },
  {
    value: "20.乌云遮日，黑猪渡河，郊外蒙蒙，田鸡阁阁。",
    explain:
      "“乌云遮日-天地黑，黑猪渡河-找不到，郊外蒙蒙-看不见，田鸡阁阁-雨将落”字面解释：此时风景无颜色。大雨即将来临。四处昏天黑地，气压低空气焖浊。正巧连过河的猪都是黑皮的。就是看远处也是模糊不清。只是耳朵能听到青蛙呱呱的叫声预示将要下大雨啦。",
    description:
      "得此课者，事情办不好，并不是你的能力的问题。而是你办事需要具备的三种条件：天时、地利、人和。但是此课都欠缺很多！努尔哈赤成功的四个因素就是两个字，一二三四的四，（四合）。这是天合、地合、人合、己合，自己的己。努尔哈赤最后的那场悲剧，谜底四不合：是天不合，地不合，人不合，己不合。",
    avoid: "妄自尊大，唯我独尊。",
  },
  {
    value: "21.雪水烹茶，桂花煮酒，一般清味，恐难到口。",
    explain:
      "喝过了用雪水煮过的茶，用桂花煮过的酒了。一般平常的清淡滋味恐怕就很难再去吃了。好事将近，要严防夜长梦多。",
    description:
      "得此课者，对生活中讲究高品位的人来说，平常人家的一般饭菜只怕是难以下咽了。",
    avoid: "荒淫腐化。",
  },
  {
    value: "22.虚而复实，实而却虚，禾头产耳，窦里生鱼。",
    explain:
      "看原词语，禾头产(生)耳是汉语词汇，解释为庄稼顶部出芽，那么这种庄稼也就报废了。此为灾年的征兆。窦里生鱼是指小洞里都能生出鱼来，也就是奇迹出现。寓意是-看上去是很合的一对 其实却不然 看上去不配的 却是你命中贤妻 此话说你东不成功西却成就姻缘 姻缘天成 不必强求 你命中必有旺夫之妻",
    description:
      "得此课者，虚实出自孙子兵法--虚实篇—主动原则. 论述虚实的运用，与如何争取主动权。“致人而不致于人，用在这里解释就是，有心栽花花不发，无心插柳柳成荫。",
    avoid: "朝三暮四。",
  },
  {
    value: "23.可叹可怜，物却有限，听之弗闻，视之弗见。",
    explain:
      "能力有限，后两句是孔子的话“鬼神之为德其盛乎，视之而弗见，听之而弗闻，体物而不可移。”意思就是冥冥之中的神力无处不在，体现在万物之中，使人无法离开这种力量。这句话体现在这一课，就是人的能力有限，看看，听听也就罢了。",
    description: "得此课者，心本同性，世世变迁，同根同源，同梦同幻。",
    avoid: "过于认真。",
  },
  {
    value: "24.栉风沐雨，戴月披星，何时可歇，直到三更。",
    explain:
      "栉风沐雨，栉读音为zhì 。意思是大雨洗发，疾风梳头。后用以形容经常在外面奔波劳碌。戴月披星，身披星星，头顶月亮。形容早出晚归，辛勤劳动，或日夜赶路，旅途辛苦。辛苦劳作不得闲，醒来就是劳动，忙完了已经到了睡觉时间。劳碌是这一课的中心思想。",
    description:
      "得此课者，忙碌必然充实，有很多行业需要忙碌。有很多行业忙碌与收获是成正比的。",
    avoid: "忙里偷闲。",
  },
  {
    value: "25.蛙鼓惊梦，虹弓东斜，蜻蜓飞舞，蝴蝶穿花。",
    explain:
      "蛙鼓惊梦, 是早晨, 但是梦醒因蛙鼓, 可见早年的梦想未必实现. 虹弓东斜.是夕阳晚照才会如此,说明天晴而绚烂,蜻蜓和蝴蝶,自然都是很惬意的景象。",
    description:
      "得此课者，雨后天晴之象，万物生机勃勃。喻活力旺盛。前半生是理想主义者，但是碰壁多，后半生会很幸福，一生过的多姿多彩。",
    avoid: "一蹶不振。",
  },
  {
    value: "26.红日遮天，绿波盖地，鱼舟稳坐，长线自持。",
    explain:
      "日遮天，绿波盖地，是说你目前的运气非常好，非常旺，一片光明，前途平坦无阻挠，渔舟稳坐,长线自持，说你有可能是个有权势的人，水为民载着你，很稳不会倾覆，长线自持已说明了你有头脑，运筹大事，可得大财（鱼已为财）！",
    description:
      "得此课者，天地之间一个悠闲、自信的渔夫。寓意是天时地利人和，一切尽在掌握。",
    avoid: "奔波劳碌，性情急躁。",
  },
  {
    value: "27.执柯伐柯，顺少逆多，总有神艺，亦末如何。",
    explain:
      "伐柯伐柯原意是砍斧柄时参考的标准就在眼前，因为手里拿的斧头的斧柄就是标准。歌谣-砍大树啊砍大树，顺境少而逆境多，但总是有些神艺，不会把你怎么着。诗经中有伐柯一篇，是说娶妻要有媒人。总之说明你的人生特别是婚姻上坎坷，但总能够闯过去。",
    description:
      "得此课者，协调一件事物或一种活动的双方，也要有一定的要求、原则、方法。从具象的斧与柄的关系，上升到抽象的一体两面的关系，这个比喻就有了广泛的意蕴，启示了一个事物发展的共同规律：按一定原则才能协调。",
    avoid: "沉默不语。",
  },
  {
    value: "28.灯油耗尽，漏声滴乏，一听鸡鸣，逍遥自歇。",
    explain:
      "灯油耗尽说明一夜未睡，漏声滴乏，一听鸡鸣， 漏声，鸡鸣以声衬静突出了黎明的寂静。逍遥自歇中逍遥是重点，体现了悠然的心情。勤于攻读，专心处理事务，虽苦却心中坦荡，天快亮了，有了收获，心情逍遥自在。",
    description:
      "得此课者，学习与工作都非常用心，并且在其中找到快乐，自身逍遥自在。异于常人，努力必有结果，付出必有回报。",
    avoid: "故步自封。",
  },
  {
    value: "29.难矣哉。",
    explain:
      "这三个字是感叹的用语，就是说做什么都很难，感叹是发自内心的一种宣泄，也是消极的一种表现。",
    description:
      "得此课者，消极是一种内心状态，及时调整，多与外界接触，找到生命的真正价值。",
    avoid: "逆来顺受。",
  },
  {
    value: "30.山不在高，有仙则名，水不在深，有龙则灵。",
    explain:
      "原意为山不一定要高，有仙人居住就成为名山了；水不一定要深，有蛟龙就成为灵异的水了。当事人才是事情的关键人物或关键所在。为主导人物。",
    description:
      "得此课者，一个人要想有所作为，要想让人生有些光彩，必须要具备四个“行”：第一，自己要“行”；第二，要有人说你“行”；第三，说你“行”的人得“行”；第四，你的身体得“行”。“人生四行”，缺一不可！",
    avoid: "自以为是。",
  },
  {
    value: "31.万朵红云连旧府，一轮明月照前川。",
    explain:
      "有千万朵吉祥之云保佑着老家，一定平安无事；有一轮明月高照，夜里不会迷失方向，心灵也不会受任何迷惑，前景光明。",
    description: "得此课者，祥云明月，赏心悦目。家宅平安，前途光明。",
    avoid: "自我陶醉。",
  },
  {
    value: "32.白玉楼中吹玉笛，红梅阁上落梅花。",
    explain:
      "此处的玉笛和梅花只是一种悠然自得的象征，象征美好仙境。同时，白玉楼、红梅阁这两个建筑象征富贵的意思。玉笛是天上的仙女伴奏，美哉。所以此句表达的是有美好的未来环境和锦绣的前程。",
    description: "得此课者，大吉大利，锦上添花，大有造就，前途无量。",
    avoid: "乐不思蜀。",
  },
  {
    value: "33.椿萱并茂，兰玉连芳。",
    explain:
      "椿:多年生落叶乔木，长寿的大椿，象征父亲；萱：可以使人忘忧的萱草。椿萱：象征父母，古称父为“椿庭”，母为“萱堂”。比喻父母健在。 兰玉，比喻优秀的子弟儿女，兰香玉润，空谷有幽兰， 美玉为君子，应该是比喻两种美好的事物在一起 佳偶天成，相得益彰。",
    description: "得此课者，父母都健康，子女聪明伶俐，德才兼备，都很不平凡。",
    avoid: "家人不睦。",
  },
  {
    value: "34.霜来树净，月落楼空。",
    explain:
      "深秋早晨，天快亮了，夜里下霜了，树叶已经飘落干净了，月亮慢慢地离去了。此刻的心情很凄静，秋悲的感觉，楼里空无一人，更显孤单。",
    description:
      "得此课者，秋悲是心理对外界的一种凄凉感觉，孤单是内心不够强大，事在人为，乐观面对人生，多交朋友。霜来树净，月落就是天明，象征着黎明前的黑暗很快就会过去，要以一颗至净的心态去迎接新的开始。",
    avoid: "心灰意冷。",
  },
  {
    value: "35.独木难支？",
    explain:
      " 一根木头支不住高大的房子。比喻一个人的力量单薄，维持不住全局。 出处—隋·王通《文中子·事君》：“大厦将颠，非一木所支也。”",
    description:
      "得此课者，注意个人能力有限，单独行动，成功率很低，融入到其他积极乐观的队伍或者行业中去，有可能会独树一帜。",
    avoid: "孤芳自赏。",
  },
  {
    value: "36.玉燕投怀。",
    explain:
      "出处:五代·王仁裕《开元天宝遗事·梦玉燕投怀》：“张说母梦有一玉燕自东南飞来，投入怀中，而有孕生说，果为宰相，其至贵之祥也。”",
    description: "得此课者，后代必出贵人，经商收益颇丰。",
    avoid: "夜梦金银。",
  },
  {
    value: "37.莫轻狂，莫轻狂，细端详，好鸟枝头亦朋友，落花水面皆文章。",
    explain:
      "为人不要轻狂或对所问之事不要着急，凡事仔细思考，枝头的鸟也可以成为朋友，落花漂流水面也是一种涵义的美，在诗人眼里就是一篇美丽文章。",
    description:
      "得此课者，满招损，谦受益的意思。忌轻狂，世间万事万物，都是你最好的帮手。",
    avoid: "螳臂当车。",
  },
  {
    value: "38.棘闱难撤，荆棘载途。",
    explain:
      "　棘闱：应试之日人山人海。棘闹难彻，意思就是考试难通。“考试”包括考场的意思及其引出的考试这个事物的意思，“难通”包括不好走的意思及其引出的难以通过、有内幕而难以弄清楚等意思。荆棘载途，意思是满路都是荆棘。比喻环境困难，障碍很多。",
    description: "得此课者，艰难险阻比较多。",
    avoid: "无。",
  },
  {
    value: "39.须谨言慎行，恐孤掌难鸣。",
    explain:
      "意思是，一个巴掌拍不响；比喻力量孤单，难以成事。 出自《韩非子·功名》“人主之患在莫之应，故曰：一手独拍，虽疾无声。”",
    description:
      "得此课者， 独来独往之征兆。所做之事难有附和者，所以需要谨慎小心。需要多交朋友，与人合作为佳。",
    avoid: "独来独往。",
  },
  {
    value: "40.鲋鱼只得西江水，霹雳一声到九天。",
    explain:
      "这是庄子笔下的一个故事：有一条鲋鱼，被困在车轮压成的一个小水坑中，当时的穷途困境，西江水引入，此鱼才能逃过此难，重回大海，化身为龙也是有可能的。",
    description:
      "得此课者，凶多吉少之象，困境非常，又不能自救，要等待时运的大变，或得到贵人施以援手，方能获得解脱。便可飞黄腾达，前途不可限量。",
    avoid: "坐以待毙。",
  },
  {
    value: "41.两手劈开名利路，一肩挑尽洛阳春。",
    explain:
      "两手劈开名利路，是名利都可以通过你的努力获得。白手起家，名利双收。一肩挑尽洛阳春，是巧用计谋，以退为进，终于功成名就，福泽后代。",
    description: "得此课者，同时注意家人安全，小心行事。",
    avoid: "口无遮拦。",
  },
  {
    value: "42.莫赌气，莫赌气，虽有长鞭，不及马腹。",
    explain:
      "不要生气，不要生气 。鞭子虽然很长，但是不应该打到马肚上。鞭长不及马腹比喻力所不能及。鞭长不及。",
    description:
      "得此课者，虽然觉得自己有一身的能力，得不到发挥。不要为了生不逢时而气愤，再气愤了。",
    avoid: "玩世不恭。",
  },
  {
    value: "43.盲人骑瞎马，夜半临深池。",
    explain:
      "凶险。一个盲人骑着一匹瞎马，深更半夜走到一个深水池边，能不危险吗？ 盲人骑着一匹瞎了的马，盲人看不见，马看不见，更可怕的是深更半夜，没人能搭救，危险参杂着危险。",
    description:
      "得此课者，另一角度看，盲人瞎马，是半夜还是白天，都不会有什么区别，危险重重，尽量不要行动。",
    avoid: "擅自行动。",
  },
  {
    value: "44.真好。",
    explain: "真好。",
    description: "得此课者，真好",
    avoid: "无。",
  },
  {
    value: "45.老天不容。",
    explain: "无。",
    description: "无",
    avoid: "无",
  },
  {
    value: "46.天覆地载，万物仰赖，鹤鸣九皋，声闻云外。",
    explain:
      "天翻地覆，象天覆盖万物，地承受一切一样。比喻范围极广大。也比喻恩泽深厚。万物仰赖，万物所依赖。鹤鸣九皋，声闻云外，是犹如仙鹤在九天鸣叫，层层云海外仍可听到其叫声。",
    description:
      "得此课者，是一个很有影响力的人，一飞冲天，一鸣惊人。闻名于世间。这种高深境界不是贩夫走卒能够理解的。",
    avoid: "目空一切。",
  },
  {
    value: "47.左右运转，前后推澜，夫人不言，言必有中。",
    explain:
      "颇具领导才能，左右逢源，众人追随之象。思维头脑敏锐，一切事物尽在掌握之中，话不多说，每说必准确无误。奇才。",
    description:
      "得此课者，毕竟不是一个简单的人，每句话都是有分量的。说多无益。",
    avoid: "信口雌黄。",
  },
  {
    value: "48.水中之月，镜里之花，几般花景，落在谁家。",
    explain:
      "一轮明月照水中，只见影来不见踪，镜里观花休认真，某望求财不顺心。镜花水月，都是看得见，摸不着的东西。那么美好的景色，都不是自己的。",
    description:
      "得此课者，不要看别人的啥都好，追求一些不着边的事。不要好高骛远，抓住实际些的事开始行动吧，还有好转的希望。",
    avoid: "好吃懒做。",
  },
  {
    value: "49.海不扬波，风不鸣条，雪飞六月，半空飘然。",
    explain:
      "海上没有波浪，风无声无息的吹着柳条，这是自然界中很正常的，雪飞六月是一件很少见的事情，六月天下满天飞舞的雪。描述的都是反常的、极少见的自然现象。",
    description:
      "得此课者， 是一件特殊的事，特殊的人，古怪，为人处世不按常理，阴阳反差极大。",
    avoid: "反复无常。",
  },
  {
    value: "50.秋风有意残杨柳，冷露无声老桂花。",
    explain:
      "秋风有意摧残杨柳，寒冷的冬季马上就会到来；寒冷的霜露无声无息的把桂花冻枯萎了。",
    description:
      "得此课者，秋是萧杀的季节，梧桐一叶落，天下皆知秋。秋，同时也是一个收获的季节，比喻会遇到不可抗拒的阻力，遭遇应该来临的挫折、打击。这都是自然规律。等待生机再次出现。",
    avoid: "听天由命。",
  },
  {
    value: "51.梅老偏能耐寒冷，菊残犹有傲霜枝。",
    explain:
      "雪辱霜欺的梅花，经受了无数次的考验，依然能高傲的开花，独具品位的菊花，即使是凋谢了，依然屹立不倒。",
    description:
      "得此课者，正是白首壮志寻大海，青春浩气走千山，永远坚信必立于不败之地。同时也证实了，山阻石拦大江必定东流去，雪辱霜欺梅花依旧向阳开。",
    avoid: "张牙舞爪。",
  },
  {
    value: "52.能。",
    explain: "能，超出常人，能忍常人不能忍，能为常人不能为。",
    description:
      "得此课者，有很多事只要用点心，就都能做到。是个努力就有结果的好现象。",
    avoid: "见强就弱。",
  },
  {
    value: "53.一心白雪阳春趣，两袖清风明月秋。",
    explain:
      "心灵纯洁人，如阳光下白雪一样清纯，同时充满了生机，洁儿不傲，春意暖暖，不贪图名利，就如八月十五的月亮一样，至清至净。",
    description:
      "得此课者，阳春白雪，两袖清风。春秋两季，白雪皓月，思想境界极高，正是有一定修养的人才能做到的，万般皆下品惟有读书高。",
    avoid: "自命清高。",
  },
  {
    value: "54.难。",
    explain: "就是难，万事开头更难，坤卦初六爻，履霜，坚冰至。",
    description:
      "得此课者，脚踩在霜上，就应该知道快冻冰了。审时度势，不变应万变，会有收获。没有否极就不会泰来。",
    avoid: "自暴自弃。",
  },
  {
    value: "55.两个黄鹂鸣翠柳，一行白鹭上青天。",
    explain:
      "两个黄鹂一行白鹭，一对在树上叫，一排在天空上飞。是两不相干的境界;但融合了一个完美的画面。两个黄鹂意思是家庭和睦，夫唱妇随。一行白鹭是一个队伍，上青天象征着一个共同的事业。",
    description:
      "得此课者，这两句是不是诸葛武侯写的还是后人抄袭了武侯原文的，已经无从考证了，千百年来民间流传下来，民间高人不断改进，这两句更能表达出这一刻的境界，主要寓意着夫妻和睦，事业兴旺。",
    avoid: "疑神疑鬼。",
  },
  {
    value: "56.春雨发生田野绿，秋风乱来满天香。",
    explain:
      "春雨过后万物新生，一片生机，秋风原不是指秋天的风，是没有完全去掉寒意的春风，带着凉气的春风飘来了遍布田野的香气，虽然略带寒气，更能体验到一种不怕危险，顽强向上的一种寓意。",
    description:
      "得此课者，是静里带着动，寒里带着暖。寒里飘着香，有时会出现内心想法与表达方式有一定偏离，让对方感到阵阵寒意，重要是为人做事能掌握一定尺度。在最恰当的时间做最恰当的事为最佳。",
    avoid: "恩中招怨。",
  },
  {
    value: "57.昨天花残犹末落，今朝露湿又重花开。",
    explain:
      "昨天调谢的花朵还没有落下呢，今天早上得到露水的滋养又从新开花了，有枯井生泉，困龙得水之象。",
    description:
      "得此课者，生命力极强，枯木逢春之意，无论遇到什么困难都会过去的，而且经过了困难会比以前更好。生生世世不息，世世生生不止。",
    avoid: "原地不动。",
  },
  {
    value: "58.好。",
    explain:
      "”好'’字有来是皇帝时期，抢婚事件不多发生，皇帝在河边遇到一个丑女，没有人会抢丑女，皇帝为了改变当时的抢婚行为，在千挑万选中,选中丑女为妻。封号嫫母 mó mǔ。很多人不理解为什么，唯有仓颉jie、风后知道其中含义，仓颉连夜给皇帝造了一个字“好”。仓颉说“男子和女子无论长相如何，只要情投意合，天长地久，就是好。”女和子组成了”好”。古代释义是，有女、有子便是好。孔子曰：吾未见好德如好色者也。也可以读四声，就是爱好多多啦。",
    description: "得此课者，一切顺利，儿孙满堂。",
    avoid: "朝三暮四。",
  },
  {
    value: "59.一朵乌云惊鸟雀，半夜残月映残花。",
    explain:
      "一朵乌云惊吓了鸟雀，正常情况下乌云与鸟雀不会发生惊吓关系的。也就是说现实中的某些事是被表象惊吓。一轮残月映照着败落的花朵上。花开花谢是自然规律，用残月来映脱，更增加了败落的表面现象。",
    description:
      "得此课者，不要被表象的事吓住，事物都是有一定的自然规律，春夏秋冬，花开花落。都属于正常自然现象。",
    avoid: "大惊小怪。",
  },
  {
    value: "60.九天日月开昌运，万里风云起壮图。",
    explain:
      "雄心壮志，大展宏图。九天之上的日月为我开辟昌运。万里风云助我大展宏图。",
    description: "得此课者，可上九天揽月，可下五洋捉鳖。非常幸运，如有神助。",
    avoid: "垂头丧气。",
  },
  {
    value: "61.方离发福生才地，又入堆金积玉门。",
    explain:
      "刚刚离开了发福发财的好地方，又进入了金玉满堂的大门之内，幸运富贵伴随左右。",
    description: "得此课者，富贵吉祥之人，幸运常伴。",
    avoid: "游手好闲。",
  },
  {
    value: "62.须放开肚皮吃饭，切站定脚根为人。",
    explain:
      "事前要做好充分的准备，站定脚跟是说的打好根基，遇事不要慌乱。步步为营，必有收获。",
    description: "得此课者，做事先做好准备，打好基础。",
    avoid: "慌不择路。",
  },
  {
    value: "63.进一步门庭，添十分春色。",
    explain:
      "本意是在前行的过程中运势好，步步高升，人生十分精彩。越往后越好，前途光明。",
    description: "得此课者，人生会非常顺利，顺利中晋升。一步比一步要更好。",
    avoid: "得意忘形。",
  },
  {
    value: "64.春风拂弱柳，细雨润新苗。",
    explain:
      "天时、地利、人和俱全。事业发展非常顺利，遇到困难会及时得到贵人帮助，一切都是欣欣向荣。",
    description: "得此课者，一切都会往好的方面发展，发展迅速，困难迎刃而解。",
    avoid: "心比天高。",
  },
  {
    value: "65.心中无险事，不怕鬼叫门。",
    explain:
      "没做过亏心的事，没招惹过谁，险事以前指害过人，心中坦荡，自然不会有人找上门来。问心无愧。",
    description: "得此课者，心胸开阔，外向，交友广泛。事业有成。",
    avoid: "小肚鸡肠。",
  },
  {
    value: "66.可也。",
    explain:
      "原文是<其志洁，其行兼。.......推此志也，虽与日月争光可也>意谓着即使说他与日月争光也可以，极力赞美人的高度亮节，成丰功伟业。语出《史记.屈原列传》。做什么都可以成功。",
    description:
      "得此课者，大事小事都可以，能力非常，不是一位普通人。把握机会，一鸣惊人。",
    avoid: "助纣为虐。",
  },
  {
    value: "67.不能。",
    explain:
      "不能，不能做的事不能做，不能说的话不能说。不能成的事，不能成。不能败的事，不能败。",
    description:
      "得此课者，什么事都不能成，也代表着什么事都不能败。准确的说，遇到困难不要躲。遇到好事时也不能让。不是'不成’而是'不能’。",
    avoid: "万事都能。",
  },
  {
    value: "68.割鸡之事，焉用牛刀。",
    explain:
      "春秋吴国人言偃，字子游，是孔子的学生，他担任鲁国武城首长时，用礼乐教化百姓，，有一天，孔子到武城，听到武城一片弦乐歌声，便微笑说道，割鸡焉用牛刀？意思是：杀鸡何必用牛刀呢，来调侃子游。治理这么小的地方，还需要动用礼仪教化吗？子游听后回答说“我曾听老师您说过，做官的学道，就会爱恤人民；百姓学道，容易接受指挥。”孔子立即向同行的的弟子表示子游是对的。后来割鸡之事焉用牛刀，比喻处理小事勿用大才。",
    description: "得此课者，大材小用了，努力展现自己，必有作为。",
    avoid: "原地踏步。",
  },
  {
    value: "69.雏鹊有巢，雏鸠居之。（鸠，八哥）",
    explain:
      "出自《召南.鹊巢》原诗，维鹊有巢，维鸠居之，之子于归，百两御之。维鹊有巢，维鸠方之。之子于归，百两将之。维鹊有巢，维鸠盈之。之子于归，百两成之。原意是夫妻两人经营了半生基业，生活富足，女人已经苍老，在以前封建社会，男尊女卑，男人又娶了一个小老婆（鸠）。在以前女人是没有任何办法的。",
    description:
      "得此课者，付出难得回报，或者是有屋不是自己住。再就是别人占有了你其他的东西。",
    avoid: "心情沉闷。",
  },
  {
    value: "70.琼浆润口，甘露滋心。",
    explain:
      "琼浆是神仙饮用的水，代表好酒。甘露，是甘蕉花苞中的甜味汁液，如喜爱的仙酒润在口中，甘甜的雨露滋润心田样美好。",
    description: "得此课者，享尽人间富贵，完美无缺。",
    avoid: "乐不思蜀。",
  },
  {
    value: "71.星移斗转，除旧换新。",
    explain:
      "星斗变换位置；表示季节改变。比喻时光流逝。移：移动；斗：北斗星。除旧换新是以新的代替旧的。",
    description: "得此课者，象征着变革。洗心革面，时来运转之象。",
    avoid: "墨守成规。",
  },
  {
    value: "72.不入虎穴，焉得虎子。",
    explain:
      "东汉明帝时，为联合西域各国共同抗御匈奴，派班超出使西域。班超和匈奴使臣同到鄯shàn善，鄯善王在两强面前，终于倾向匈奴，冷淡了汉使。在关键时刻，班超召集部下三十六人，经过计议，乘黑夜以火攻为助，杀死匈奴使臣，并奋勇击败匈奴的反扑，终于震慑鄯善，使之与汉修好。",
    description:
      "得此课者，不敢于冒危险，就不能做出成就，取得胜利；比喻不经过艰苦的实践，就不能取得真知。",
    avoid: "一意孤行。",
  },
  {
    value: "73.鹬蚌相持，渔人得利。",
    explain:
      "一只河蚌张开蚌壳，在河滩上晒太阳。有只鹬(yù)鸟，从河蚌身边走过，就伸嘴去啄河蚌的肉。河蚌急忙把两片壳合上，把鹬嘴紧紧地钳住。。鹬鸟瓮声瓮气地说：“今天不下雨，明天不下雨。世上又会少一只蚌!”河蚌也瓮声瓮气地说：“假如今天你的嘴拔不出去，明天你的嘴拔不出去，世上又会多一只死鹬!”河蚌和鹬鸟吵个不停，谁也不让谁。这时，恰好有个打鱼的人从那里走过，就把它们两个一起捉去了。现在用来比喻双方相持不下，结果两败俱伤，让第三者得利。",
    description:
      "得此课者，有可能是失利者，也有可能是得利者。谨慎小心不与人争，便是得利者。",
    avoid: "你争我夺。",
  },
  {
    value: "74.凤毛济美，麟趾呈祥。",
    explain:
      "凤毛：凤凰的羽毛，喻指少有而可贵的人或事。济：成，比喻后继者了得，能与前人奇美发扬光大。古时候，多称颂贤良父兄有优秀子弟。麟趾呈祥，这里指子孙昌盛。旧时祝贺别人生子，常用麟趾呈祥一语。",
    description:
      "得此课者，整体本意是说儿子继承父亲的事业，继续做官。跟父亲一样优秀。意思是说家中后代人才辈出，且前辈也是人中龙凤。",
    avoid: "贪得无厌。",
  },
  {
    value: "75.芝兰竟秀，玉树生香。",
    explain:
      "东晋时，朝臣多是王、谢两大家族成员担任, 王、谢两家不但是贵族，而且是非常有名望的贵族。谢家的谢安是当时晋朝执掌朝政的宰相，很注意培养后代。谢玄是谢安的侄子，有一天，谢安问子侄们：“你们将来长大了干什么？”谢玄在旁边说：我将来要象“芝兰玉树，立于高堂之前”。“芝兰玉树”就是名贵的兰草和玉做的树，意思是说他要做高品质、高品位、有气节的人，立于殿堂之前，为国家服务。谢安心里为之一动。所以，谢安开始对谢玄另眼相看，觉得他从小就与众不同。 后来，前秦苻坚侵犯东晋，谢安任命谢玄先锋在肥水一仗打败了苻坚，从此谢玄扬名朝野。此战即是有名的“淝水之战”。“芝兰玉树”本来是谢玄小时候的话就成了成语。这里指德才兼备的人才。",
    description: "得此课者，是形容节操高尚，品德纯洁，名震天下，受人尊重。",
    avoid: "目中无人。",
  },
  {
    value: "76.不危不陷，去而复反。",
    explain:
      " “不危不陷，去而复反”的意思是：做任何事情如果一路平安，没有危险的，往往事情不会成功，去了也还是要回到原来的地方。 总的来说就是：如果做事情没有什么阻碍困难，但是最后结果却往往是事倍功半，没有结果。生活正如那充满玄妙的“不危不陷，去而复返”一样，充满了轮回和玄机，比如有顺利，就有困难和挫折；有成功，就有阻碍和失败；有困难，就有鼓励和成功；有哭泣，就有微笑；有温暖，就有寒流；有付出，就有收获。没有任何风险和付出的事情，是永远不存在的。",
    description:
      "得此课者，就是'富贵险中求’，但凡没有风险的事情，做了基本也是白做。所以说'去而复返’去了也是空手而回。",
    avoid: "胆小怕事。",
  },
  {
    value: "77.泰阿倒持，与谁有益。",
    explain:
      "泰阿倒持，出处：《汉书·梅福传》：“至秦则不然，张诽谤之罔，以为汉驱除，倒持泰阿，授楚其柄。” 倒拿着剑，把剑柄给别人。比喻把大权交给别人，自己反受其害。又据《越绝书》记载，欧冶子曾应楚王之邀与干将(传说与欧冶子同师)一起“凿茨山，泄其溪，取铁英，作为铁剑三枚：一曰龙渊、二曰泰阿、三曰工布”。楚王曾引泰阿之剑大破晋郑王三军。泰阿是春秋战国时代中国著名的宝剑。",
    description:
      "得此课者，要谨慎掌握自己的主动权，防备对手反客为主，对自己造成严重打击，严重后果等。",
    avoid: "不知好赖。",
  },
  {
    value: "78.春暖鱼跃，秋高鹿鸣",
    explain:
      "春暖鱼跃，秋高鹿鸣，体现了两者在得天时、地利、人和的优越条件下，兴奋的跳跃，高声的鸣叫，真是天高任鸟飞，海阔凭鱼跃的意象。",
    description:
      "得此课者，自然条件优越，没有任何危险，随心随性，任意而为。悠闲自得，快乐无限。",
    avoid: "危机四伏，掉以轻心。",
  },
  {
    value: "79.帮虎吃食，有损无益。",
    explain:
      "帮助老虎找东西吃，老虎得势必危害一方百姓，自古说伴君如伴虎，是一件很危险的事，同时对自己没有一点好处，危险无处不在。",
    description:
      "得此课者，帮助比自己强横很多的人做了对自己无益的事，牵连自己卷入危险之中。百害而无一利。",
    avoid: "助纣为虐。",
  },
  {
    value: "80.树欲静，而风不止。",
    explain:
      "本句出自《汉·韩婴·韩诗外传》。春秋时孔子偕徒外游，忽闻道旁有哭声，停而趋前询其故，哭者曰：“我少时好学，曾游学各国，归时双亲已故。为人子者，昔日应侍奉父母时而我不在，犹如'树欲静而风不止’；今我欲供养父母而亲不在。逝者已矣，其情难忘，故感悲而哭。”借树欲静，而风不休不止吹之为喻。实叹人子欲孝敬双亲时，其父母皆已亡故。后喻事与愿违，不尽人意。或客观情况与主观愿望相悖，多用此语。",
    description:
      "得此课者，树欲静而风不止，子欲养而亲不待。想做的事，总是不能按自己的想法完成，就如树要休息，风一直在刮，不能无干扰的完成某一件事情。事与愿违。",
    avoid: "心乱如麻。",
  },
  {
    value: "81.蜻蜓飞舞，在池塘。",
    explain:
      "蜻蜓在适合生存地方飞舞，是一件快乐而悠闲的境界。池塘是蜻蜓产卵繁育后代的最佳环境，也主生养之所。",
    description: "得此课者，安居乐业，无忧无虑。儿孙满堂。",
    avoid: "无。",
  },
  {
    value: "82.砍倒大树，有柴烧，财源茂盛宦中佼。",
    explain:
      "砍倒大树，有柴烧，是通过自身努力，大量储备的意思，财源茂盛宦中佼，佼的意思，超出常人。古时在官场现实中，钱通神路，有钱才会做更大的官。才能成为官中的佼佼者。",
    description: "得此课者，喻意家境富足，官居显赫。",
    avoid: "贪赃枉法。",
  },
  {
    value: "83.眼看明月落人家。",
    explain: "这里明月指的是女性，也泛指阴性事物。财，指偏财。",
    description:
      "得此课者，明月指光亮、美好、漂亮。想得到的人或事物。但是都落到别人家去了。",
    avoid: "因爱生恨。",
  },
  {
    value: "84.正遇双星渡雀桥。",
    explain:
      "牛郎织女，每年七月初七，喜鹊组成一座桥，牛郎织女跨过银河来相会。神仙一年才出来相会一次，正好遇上了。",
    description:
      "得此课者，很幸运，也就是奇迹出现了。有很多事是你能做到，而其他常人是无法做到的。",
    avoid: "夜梦金银。",
  },
  {
    value: "85.有",
    explain:
      "有，意指有情生命的色心存在于三界当中之状态。有字既为“又”的通假字，还可以作为名词来理解，词义也很丰富。可表示存在，所属，发生等词义。可为动词、形容词、副词等词性。",
    description:
      "得此课者，道德经说：天下万物生于有，有生于无。有作为动词，那就是行动了才会有。无动于衷，无是不能生有的。",
    avoid: "无中生有。",
  },
  {
    value: "86.一条明路直达青天，半途而废可叹可叹。",
    explain:
      "半途而废，中国古代典故之一，出自西汉·戴圣《礼记·中庸》：“君子遵道而行，半途而废，吾弗能已矣。”后转化为成语，本义为路走到一半停了下来，比喻事业没做完就停止，不能善始善终，做事有头无尾。比喻在胜利的道路上越走越远。",
    description:
      "得此课者，前景非常好的事业或者追求，直达青天，就如在等天梯上，爬了一半，放弃了。立下了目标，就要敢于实践，努力完成，只会空想是不对的，半途而废也是不对的。",
    avoid: "畏刀避剑。",
  },
  {
    value: "87.执柯伐柯，其辙不多，不费手脚，更无风波。",
    explain:
      "拿着斧子，去砍斧子的柄，这个柄的样子就在手里，操作起来和简单，很容易，不会费劲就能照着手里的样子再做一个。在现实中这样的事不多，不用自己去摸索了，省时省力。",
    description: "得此课者，名师指路，做事成功率高。",
    avoid: "骑马找马。",
  },
  {
    value: "88.闲时赏月，忙里跑风，弄到其毕，内净外空。",
    explain:
      "闲时赏月，忙里跑风，弄到其毕，内净外空。闲时赏月，一个人在没事的时候欣赏月亮的美丽，很悠闲，很有情趣。忙里跑风，一个人在忙的时候做起事来象风一样，很忙碌，速度很快，是一个人正在疯狂的忙碌，弄到其毕，内净外空。毕，是结束的意思，就是到最后一干二净。",
    description:
      "得此课者，忙时忙的很，闲时闲的很。菜根谭里有一句话，“闲里吃紧，忙里偷闲。”做事情要有主次，分出轻重，忙时要看收获。",
    avoid: "麻木不仁。",
  },
  {
    value: "89.仰赖天地，何必曰利，只须勤俭，胜似贸易。",
    explain:
      "仰仗着天时地利，不需要每天必须有看得见的收入，只要能勤俭持家，比做生意剩下的财物还要多很多。",
    description:
      "得此课者，能看出来，最重要的是节俭，节俭了，所有的事也就好了。时运自然就好了。",
    avoid: "酒池肉林。",
  },
  {
    value: "90.浮生若梦，不用妄贪，知足常乐，能忍自安",
    explain:
      "浮生若梦，是一个成语，读音是，意思是把人生当作短暂虚幻的梦境。谓世事无定，生命短促，如梦幻一般。不用妄贪，没有必要贪图什么，人生如白驹过隙，弹指间樯橹灰飞烟灭。心态乐观 坦然面对 心中自然快乐欢愉。能忍自安 生活如意 知足常乐无忧无虑，如此人生 平安顺利！",
    description:
      "得此课者，人生道路坎坷崎岖，常有各种未知遭遇。临危不惧， 坚持搏击 ，能忍自安灾祸离去。能知足者 ，心中常喜 ，感恩天地。蓝天白云常在， 青山绿水长流， 世间万物生老病死都是世间常理。放下，才会有生机。",
    avoid: "念念不忘。",
  },
  {
    value: "91.江水洗心，江月照肝，争战南北，不难不难。",
    explain:
      "江水洗心，江月照肝，两句表明了此人志向很高，下定决心，赤胆忠心，光明磊落，大将风范，有如此雄心壮志，平定天下都很简单。",
    description: "得此课者，是一将才，得天时、地利、人合者必成大器。",
    avoid: "有勇无谋。",
  },
  {
    value: "92.一好百好，一了百了，不啻雷惊，何殊风扫。",
    explain:
      "一好百好，有两个意思，第一个内含，有受人滴水之恩当涌泉相报的意思。容易感动。第二个是顺利，一个顺一百个顺。一了百了，是说一个错误，全部都没有了。不啻chì雷惊，何殊风扫，是不异于雷惊，更不异于风扫。这两句是速度极快的意思。是映脱前两句的。",
    description: "得此课者，事物钱财来得也快，去得也快。来去如风。",
    avoid: "雷厉风行。",
  },
  {
    value: "93.离而复合，成而必破，再费唇舌，亦未如何。",
    explain:
      "离而合，合而离，分开了又在一起，在一起还会分开，即使现在能在一起，终究也还是要分开的，再浪费那么多时间，浪费那么多感情，浪费那么多口舌，到最后还能怎么样呢。",
    description:
      "得此课者，不必太执着了，天下的事都是合久必分，分久必合。放下才会有收获。",
    avoid: "死缠烂打。",
  },
  {
    value: "94.前门拒虎，后门进狼，慎之慎之，切勿要强。",
    explain:
      "前边有虎，后边有狼，所处地理条件危险，周围环境十分凶险。一定要加倍小心谨慎，千万不要逞强。忍一时风平浪静，退一步海阔天空。",
    description: "得此课者，居安思危，做好防范，物极必反，否极泰来。",
    avoid: "意气用事。",
  },
  {
    value: "95.不做风波于世上，自无冰炭在胸中。",
    explain:
      "不在世间兴风作浪，自然心中无愧，人生无大举动，对世事自然心静，心中自然没有水火交加的感觉。",
    description: "得此课者，不与人争，知书达理。",
    avoid: "不求上进。",
  },
  {
    value: "96.莫惆怅，莫惆怅，命里八尺，难求一丈。",
    explain: "命里有时终须有，命里无时莫强求。",
    description:
      "得此课者，一命、二运、三风水、四积阴德、五读书。命是运的一种运势的约束，要想摆脱命运束缚，做好以上五点。八尺会变成八丈。",
    avoid: "听天由命。",
  },
  {
    value: "97.间里自夸金屋好，扰中不觉玉山颓。",
    explain:
      "情绪高时，自己在家夸自家好，就如金屋一样完美无瑕。情绪低弱时，身在玉山之中，也是黯淡无光。",
    description:
      "得此课者，情绪变化反差极大，好时不能再好了，什么都好。差时候就不能再差了，什么都差的太多了。",
    avoid: "悲愤填膺。",
  },
  {
    value: "98.猛虎斗，飞龙争，水落石出草木皆醒。",
    explain:
      "龙争虎斗，是王者之间的较量，必然带来大的大环境波动，震天动地。最后必然有胜出的一方，水落石出，是胜负已成定局，胜者为王，败者寇。草木指百姓，最后百姓也都知道了。",
    description:
      "得此课者，身在局中争斗者，并非贩夫走卒之辈。争斗以后得知真相者才是贩夫走卒。知道了，什么也就迟了。一切事物，在最恰当的时间，一定要出现在最恰当的位置。一定要把握时机，机不可失，失不再来。",
    avoid: "道听途说。",
  },
  {
    value: "99.落花流水沓然去，大块文章尽属虑。",
    explain:
      "历史已经久远，有很多事我们都无法考证，无法知道当时的真伪，有很多我们流传在市面上的名著，其实都是虚假的。",
    description:
      "得此课者，举两个例子，《西游记》玄奘是一个人偷逃出去的，那三位根本就没有，后期有马了，何止是几匹马的事啊。《水浒传》真正有几个人在山上呢。玄之又玄，众妙之门。",
    avoid: "偏听偏信",
  },
  {
    value: "100.一樽美醴倾荒野，两袖春风扫故尘。",
    explain:
      "一樽美醴lǐ 倾荒野，有大的才能，得不到真正的施展空间，美酒倒在荒野上，实属无用武之地，得不到施展才华。两袖春风，是什么都没有，清清白白。扫故尘，是家乡的尘土。回到了家乡。就是在外边有才能不得重用，不如清清白白回家乡。",
    description: "得此课者，大材小用，时运不济。",
    avoid: "知难而退。",
  },
  {
    value: "101. 知足方能图快乐，吃亏纔（才）是发财源。",
    explain:
      "知足常乐，谓侯王知道满足则心常快乐。出自《道德经》：“祸莫大於不知足，咎莫大於欲得，故知足之足，常足矣。”'知足常乐，吃亏是福。’",
    description:
      "得此课者，能吃亏的人，是境界和修养极高的人，常人不理解阴阳变化的内在高深境界，知足者不是满足，是知道现有的和未来的结果，到这里就可以了，而感觉到应该知足了。",
    avoid: "人心不足。",
  },
  {
    value: "102.苦雨催残李桃色，凄风吹折杨柳枝。",
    explain:
      "苦雨是冰霜的雨，把桃子、李子摧残的变了颜色。凉风把柳树的枝条都折断了。",
    description: "得此课者，外在的条件改变了本来的面目。有主见，才可以有成果。",
    avoid: "墙头草。",
  },
  {
    value: "103.发财臻极宜先退，得意到浓便好休。",
    explain:
      "财不外露，得到了就撤出来，不要贪。做官达到一定程度，就要功成身退。",
    description:
      "得此课者，《道德经》天长地久。天地所以能长且久者，以其不自生，故能长生。是以圣人后其身而身先，外其身而身存。非以其无私邪？故能成其私。有很多事是退一步才能保全自己的。道德经这一段就是为官发财能知道退出的最高境界了。",
    avoid: "恋栈不去。",
  },
  {
    value: "104.灯火报，喜雀叫，燕子双双反故巢。",
    explain: "夫妻和睦，喜事连连，子孙绕膝，家庭和睦之象。",
    description: "得此课者，是大吉大利之象，归巢，有衣锦还乡之象。",
    avoid: "无。",
  },
  {
    value: "105.风中烛，瓦上霜，虽耀耀，不久长。",
    explain: "风中之烛，瓦上之霜，都有光亮，并不长久。",
    description: "得此课者，做什么事要往远了看，放开心胸，广交好友，必有收获。",
    avoid: "一叶障目。",
  },
  {
    value: "106.桃红复含宿雨，柳绿更带朝烟。",
    explain: "桃子成熟时缺水的雨，是的天时地利。后一句的人合。",
    description: "得此课者，万事顺利，贵人常在。稍加努力，人前显贵。",
    avoid: "忘恩负义。",
  },
  {
    value: "107.鼎折足，车脱辐，日过午，风吹烛。",
    explain:
      "鼎是古代的一种容器，腿断了；车的辐条断了，太阳过了正午，阳已开始转阴，风吹蜡烛。为残缺不全、失去平衡，走下坡路之象。",
    description: "得此课者，表象警告你要积极上进，逆水行舟，不进则退。",
    avoid: "得过且过。",
  },
  {
    value: "108.小心哉，莫务外，一步错，百步歪。",
    explain:
      "小心谨慎，不要被外界的花花世界所引诱，走错了路，就会一入红尘深似海。以后想走正道就难了。",
    description: "得此课者，稳扎稳打，步步为营。必有成就。",
    avoid: "慌不择路。",
  },
  {
    value: "109.桃李争春色，春去桃李撇。",
    explain:
      "《三十六计》李代桃僵，桃生露井上，李树生桃旁。虫来啮桃根，李树代桃僵。树木深相待，兄弟还相忘。”",
    description:
      "得此课者，在一个时代会出现一个时代的风云人物，抓住时运，看清自己位置，不与人争，用心做事，必有成就。有一诗为证，”千里家书只为墙，让他三尺又何妨。长城万里今犹在，不见当年秦始皇。”",
    avoid: "互不相让",
  },
  {
    value: "110.为山九仞，功亏一簣。",
    explain:
      "此句出自《尚书》，为山九仞，与“功亏一篑”连用，指要建造九仞高的山，差一筐土石不倒在山顶上，那么山的高度就不会达到九仞，就会失败。功亏于不能执着坚持。含有惋惜之意。",
    description:
      "得此课者，只差最后一点而不能成功，说的是堆砌一座山，已经堆了很高很高，只差最后一筐土，可是没有完成，这时放弃了，失败了。为人要持之以恒，永不言弃，最终会大有所成。",
    avoid: "忍痛割爱。",
  },
  {
    value: "111.先如山倒，后若抽丝。",
    explain:
      "病来如山倒，病去如抽丝，是一句古语。来的时候非常快，好的时候得慢慢调养着。",
    description:
      "得此课者，这是古人一种夸张的说法，事业上是先期投入大，钱回来的慢，其他事也是如此，先付出后，慢慢的能收回来。",
    avoid: "倾尽所有。",
  },
  {
    value: "112.失之东隅，收之桑榆。",
    explain:
      "《后汉书·冯异传》：东汉刘秀即位为光武帝后，派大将冯异率军西征，敉mǐ 平军。赤眉佯败，在回溪之地大破冯军。冯异败回营寨后，重召散兵，复使人混入赤眉，然后内外夹攻，在崤xiáo底之地大破赤眉。事后，刘秀下诏奖之，谓冯异初虽在回溪失利，但终能在渑池获胜。可谓在此先有所失，后在彼终有所得，当论功行赏，以表战功。“始虽垂翅回溪，终能奋翼黾池，可谓失之东隅，收之桑榆。",
    description:
      "得此课者，东隅：东方日出处，指早晨；桑、榆：指日落处，也指日暮。比喻开始在这一方面失败了，最后在另一方面取得胜利。此课说的是，这一方面败了，却在另一方面成功了。意思是在你注意力之外的地方，取得了意想不到的成功。",
    avoid: "一蹶不振。",
  },
  {
    value: "113.刻鹄类鹜，画虎成犬。",
    explain:
      "鹄hú,，鸟名，即天鹅，像鹅而大，羽毛白色，飞得高而快，生活在水边；鹜wù野鸭子。把天鹅雕刻得像野鸭子，把老虎画成狗。",
    description:
      "得此课者，没有实际本领，心气却很高，目标很远大。最终无法完成目标。",
    avoid: "敷衍了事fū yǎn liǎo shì。",
  },
  {
    value: "114.红梅结子，绿竹生孙。",
    explain:
      " 红梅结子，植物梅的果实，结子：生长到成熟并产生种子。子，有儿子之义，结子即为生儿子之意。 绿竹生孙，孙，是竹子初从土里长出的嫩芽。生孙：生出新笋。生孙，表示“子又生孙，孙又生子；子又有子，子又有孙。子子孙孙，无穷匮也”",
    description: "得此课者，儿孙满堂，家业昌盛。",
    avoid: "拈花惹草。",
  },
  {
    value: "115.前车之覆，后车之鉴。",
    explain:
      "出自，《荀子.丞相》：“前车已覆，后未知更何觉时！”汉·刘向《说苑.善说》：“前车覆，后车戒。”",
    description: "得此课者，多总结前人经验，选对方向，避免失误。",
    avoid: "独断专行。",
  },
  {
    value: "116.获罪于天，无所祷也。",
    explain:
      "；原文，王孙贾问曰：“与其媚于奥，宁媚于灶，何谓也？”子曰：“不然，获罪于天，无所祷也。” 王孙贾是卫国大夫，觉得自己身份卑微，把自己比拟为灶神，他的意思是，去谄媚房屋西南角的神，不如谄媚灶神，来提醒孔子尊神虽大，未必能造福家人，灶神虽卑，常能保佑家人。希望孔子不要小看他。孔子趁机告诉大家，神的尊卑并不重要，祭拜的人，是不是遵守正当的道理才最重要，若是违背正当道理，谄媚什么神，都没有用。",
    description:
      "得此课者，一切成败都在自己心中，墙角的神，还是尊神，都是自己心中的神，人知其神而神，不知其不神之所以神也。",
    avoid: "偏听偏信。",
  },
  {
    value: "117.半途而废，令人落泪。",
    explain:
      "出自：《礼记·中庸》：“君子遵道而行，半途而废，吾弗难已矣。”后转化为成语，本义为路走到一半停了下来，比喻事业没做完就停止，不能善始善终，做事有头无尾。寓意在胜利的道路上越走越远。立下了目标，就要敢于实践，努力完成，只会空想是不对的，半途而废也是不对的。",
    description:
      "得此课者，遵道，《道，可道，非恒道也》，半途而废，是很多人的通病，一百人里有二十人能成功，只有少数人成功，放弃与不放弃，成功与不成功，是有一定比例的。是不是半途而废完全取决于个人内心是否真正强大。",
    avoid: "半途而废。",
  },
  {
    value: "118.朝琢久磨，其命如何。",
    explain: "每天都在琢磨，自己的命怎样呢。",
    description:
      "得此课者，人生需要琢磨的，不是你的命如何，主要是自己能不能战胜自己，人生最大的敌人是自己。自己可以找到很多阻止自己行动的一些理由与借口。每个成功者每天琢磨自己差在哪里？应该怎么办？我应该怎么办？其他人会怎么办？曾子曰：”吾日三省吾身；为人谋而不忠呼？与朋友交而不信乎？传不习呼？”白话文就是：每天反省三件事，为他人办事有没有不尽心尽力？与朋友交往是否讲诚信了？老师的传授有没有复习呢？",
    avoid: "不学无术。",
  },
  {
    value: "119.命该如此，不可妄想。",
    explain: "命运基本就这样了，不去妄想会更好一些。",
    description:
      "得此课者，命运是不是就如此了，取决于自己，不去实现主观的理想与追求。想实现理想与追求，就要付出行动，多学习增长自己的能力。如果不求上进，想不想作用都不大，命运也就该如此了。",
    avoid: "不求上进。",
  },
  {
    value: "120.精卫填海，枉费心机。",
    explain:
      "出自《山海经·北山经》：“炎帝之少女名曰女娃。女娃游于东海，溺而不返，故为精卫，常衔西山之木石，以堙yīn（埋没）于东海。”精卫：古代神话中的鸟名。精卫衔来木石，决心填平大海。旧时比喻仇恨极深，立志报复。后比喻意志坚决，不畏艰难。",
    description:
      "得此课者，表面上看，是不可能完成的事，有很多大事做出来都是千秋万代的，有很多大生意是经过几辈人才能完成的，越大的事，在贩夫走卒眼里，越是无法完成的，在没成功以前，其他人通常会用精卫填海来这样看你的。",
    avoid: "风言风语。",
  },
  {
    value: "121.于心难忍，于心难安。",
    explain:
      "于心何忍，是怎能忍心，即内心不忍。于心难安，在心里有什么愧疚的事。导致心理不安。",
    description:
      "得此课者，能出现这两点的人，必定是一个心地善良的人，每个人都会有经历，放下这些外在的影响，打开心胸。一切向前看。一路向前走。",
    avoid: "牵三挂四。",
  },
  {
    value: "122.秋风过耳，何必着急。",
    explain:
      "出自汉·赵晔《吴越春秋·吴王寿梦传》：“富贵之于我，如秋风之过耳。” 意思是，像秋风从耳边吹过一样。 比喻与己无关，毫不再意。没必要着急。",
    description:
      "得此课者，与己无关的事，看看听听也就行了，不要让外界影响自己心情。自家自扫门前雪，休管他家瓦上霜。春有百花秋有月，夏有凉风冬有雪，若无闲事挂心头，便是人间好时节。",
    avoid: "事无巨细。",
  },
  {
    value: "123.求而得之，舍则失之。",
    explain: "意思是想要的就会来，不想要的就会去，庖丁解牛，游刃有余。",
    description: "得此课者，在处理任何事情都很有智慧，一切事都尽在掌握。",
    avoid: "拖泥带水。",
  },
  {
    value: "124.管中窥豹，井底观天。",
    explain:
      " 管中窥豹，意思是从竹管的小孔里看豹，只看到豹身上的一块斑纹。比喻只见到事物的一小部分，指所见不全面或略有所得。井底观天，出自《庄子.秋水》：“井蛙不可以语于海者，拘于虚也。”井底的蛙只能看到井口那么大的一块天。比喻那些见识短浅的人 。",
    description:
      "得此课者，容易因为环境的局限，只能看到事务的一小部分，这导致了对事物的局限性与错误的理解。",
    avoid: "依然故我。",
  },
  {
    value: "125.既知如此，何必如此。",
    explain:
      "既然都知道会是什么结果，还是去验证了结果，早知如此绊人心，何如当初莫相识。",
    description:
      "得此课者，事物都一定的必然结果，万物都是有一定规律的，不要认为自己是幸运的，什么都不会发生在自己身上。《观天之道，执天之行尽矣。》",
    avoid: "掩耳盗铃。",
  },
  {
    value: "126.塞翁失马，反求诸己。",
    explain:
      "出自《淮南子.人间训》：“近塞上之人有善术者，马无故亡而入胡。人皆吊之。其父曰：'此何遽jù不为福乎？’居数月，其马将胡骏马而归。人皆贺之。…故福之为祸，祸之为福，化不可极，深不可测也。” 原意解释，有位擅长推测吉凶掌握术数的人居住在靠近边塞的地方。一次，他的马无缘无故跑到了胡人的住地。人们都为此来宽慰他。那老人却说：“这怎么就不是一种福气呢？”过了几个月，那匹失马带着胡人的许多匹良驹回来了。人们都前来祝贺他。那老人又说：“这怎么就不是一种灾祸呢？”算卦人的家中有很多好马，他的儿子爱好骑马，结果从马上掉下来摔断了腿。人们都前来慰问他。那老人说：“这怎么就不是一件好事呢？”过了一年，胡人大举入侵边塞，健壮男子都被征兵去作战。边塞附近的人，死亡众多。惟有塞翁的儿子因为腿瘸的缘故免于征战，父子俩一同保全了性命。",
    description:
      "得此课者，用发展的眼光辩证地去看问题：身处逆境不消沉，树立“柳暗花明”的乐观信念；身处顺境不迷醉，保持“死于安乐”的忧患意识。",
    avoid: "得意忘形。",
  },
  {
    value: "127.玳鸫在东，莫之敢指；生意兴隆，指日高升。",
    explain:
      "玳鸫dài dōng 出自《诗经鄘yōng风蝃蝀》，蝃蝀，dì dòng 即彩虹，又称美人虹，其形如带，半圆，有七种颜色，是雨气被太阳返照而成。古人因缺乏自然知识，以为虹的产生是由于阴阳不和，婚姻错乱，因而将它视作淫邪之气，如刘熙云：“淫风流行，男美于女，女美于男，互相奔随之时，则此气盛。”，彩虹在东边出现，自然是一件令人忌讳的事，所以大家都“莫之敢指”。本句的意思是说，彩虹出现在东面，气盛，是物极必反的一种现象，好事马上就来到了。",
    description:
      "得此课者，前边彩虹感觉不一定是好的兆头，但实际意义生意出现好的兆头，生意会非常好，在东方是步步高升的意思。也代表这个生意别人都看着不行，但是你看出了巨大财富，做了以后得到了巨大收获。富贵险中求。",
    avoid: "扑风捉影。",
  },
  {
    value: "128.拨开黑雾见晴天。",
    explain:
      "拨开了黑雾笼罩，见到了晴天，见到了光明，得到了希望，另外可以比喻为见到了事情的真象。真相大白，苦尽甘来之象。",
    description: "得此课者，时来运转，苦尽甘来。大吉。",
    avoid: "坐以待毙。",
  },
  {
    value: "129.丸泥可以封函关。",
    explain:
      "一团小泥丸；封：封闭。用一小团小泥丸就可把函谷关封闭住。比喻地形险要，用少量兵力即可固守。",
    description:
      "得此课者，有一夫当关，万夫莫开之象，在某一个领域内，起主导作用。能力超群。",
    avoid: "力不从心。",
  },
  {
    value: "130.首鼠两端，花开能有几时红。",
    explain:
      "出自-《史记·魏其武安侯列传》：“武安已罢朝；出止车门；召韩御史大夫载；怒曰：”与长儒共一老秃翁；何为首鼠两端？” 意思是：鼠性多疑，出洞时一进一退，不能自决；两端：拿不定主意。 在两者之间犹豫不决又动摇不定。花开能有几时红，意思是花开虽艳，但不长久。",
    description:
      "得此课者，疑神疑鬼，常常进退两难，犹豫不决来做关键性决策，就是再好的事，到最后都会失去的。",
    avoid: "进退维谷。",
  },
  {
    value: "131.同心合意步云梯。",
    explain:
      "古时候的战争，云梯是用来攻城的，云梯需多人配合才能产生攻城的效果。",
    description: "得此课者，要与人合作，同心协力，必有大的成就，大的收获。",
    avoid: "疑心生鬼。",
  },
  {
    value: "132.一杆明月钓秋风。",
    explain: "明月是弯弯，秋风却无型，不知钓何意，何意还是空。",
    description: "得此课者，无影无形，最终无结果。",
    avoid: "扑风捉影。",
  },
  {
    value: "133.掌上明珠粪土埋。",
    explain:
      "出自-晋·傅玄《短歌行》：“昔君视我；如掌中明珠；何意一朝；弃我沟渠。”掌上明珠，比喻接受父母疼爱的儿女，特指女儿。粪土埋，是埋没的意思。",
    description:
      "得此课者，自己最喜欢的东西，最大的潜能，都没有得到正常发挥，埋没了人才。注意把握时机，全力以赴，必有明珠出土的一天。",
    avoid: "自暴自弃。",
  },
  {
    value: "134.池上于今有凤毛。",
    explain:
      "杜甫写朝堂应酬的诗，池上于今有凤毛，用的是南北朝时期的典故。贾至官至中书舍人，掌管皇帝诏书，贾至受到皇帝的恩宠。贾至的父亲曾是朝中中书令。贾至继承父业且发扬了父亲的才华和能力。子承父业，光耀门庭。",
    description: "得此课者，家庭及个人都很有能力，子承父业，世代昌盛。",
    avoid: "后继无人。",
  },
  {
    value: "135.麟趾春深步玉堂。",
    explain:
      "麟，仁兽。具有有蹄不踏，有额不抵，有角不触的仁厚秉性。麒麟是仁兽，是吉祥的象征，能为人带来子嗣，而且麒麟是正义之财的象征。麒麟代表祥瑞，代表兴旺发达。代表仁厚，代表威严的气质。",
    description: "得此课者，好事进门，事业兴旺发达，人旺财旺。",
    avoid: "为富不仁。",
  },
  {
    value: "136.越鸡焉能孵鹄卵。",
    explain: "南方的小鸟孵化不了天鹅的蛋，超出能力范围了。",
    description:
      "得此课者，做事要量力而行，好大喜功，好高骛远，将一事无成。脚踏实地，用心经营必有收获。",
    avoid: "游手好闲。",
  },
  {
    value: "137.莺鸠竟敢笑大鹏。",
    explain: "意思是小鸟居然敢嘲笑大鹏。",
    description:
      "得此课者，有两条意思，第一就是自己是小鸟，去笑话那些做大事的人，看不懂，跟不上。第二是自己是做大事业的人，其他人看不明白，在你没有成功前嘲笑你。是小鸟还是大鹏都不能去笑话其他人，小马乍行嫌路窄，大鹏展翅恨天低。三缄其口，就是尽量少说话。",
    avoid: "五十步笑百步。",
  },
  {
    value: "138.清草池塘处处蛙。",
    explain:
      "青草，池塘，是青蛙得天时、地利、人合、己合俱全，是某一领域的领导者。",
    description: "得此课者，经历风雨后，必见彩虹。付出必回报。天成之象。",
    avoid: "无。",
  },
  {
    value: "139.鸟兽不可与群同。",
    explain: "天上飞的鸟，地下跑的动物，不是同一类型。不可能成群结队。",
    description:
      "得此课者，人与群分，物以类聚。意思是在某一个领域，是一个极有个性的人，很有可能你就是一个独出手眼的天才。",
    avoid: "鱼龙混杂。",
  },
  {
    value: "140.蜻蚨飞去复飞来。（蚨：fú 古代用作铜钱的别名）",
    explain: "钱财就像蜻蜓一样，飞去又飞来。",
    description:
      "得此课者，天生我才必有用，千金散尽还复来。意思是一生或者事业，三起三落，最终结果很好，事业有成，白手起家。",
    avoid: "嗜赌成性。",
  },
  {
    value: "141.柳暗花明别有天。",
    explain:
      "垂柳浓密，鲜花夺目。柳树成荫，繁花似锦的春天景象。比喻在困难中遇到转机。",
    description: "得此课者，苦尽甘来，时来运转。",
    avoid: "萎靡不振。",
  },
  {
    value: "142. 双斧伐孤树，财旺晋官禄。",
    explain: "文武全才，升官发财之象。",
    description: "得此课者，双指事半功倍，也指文武全才。官财两旺。",
    avoid: "荒淫无度。",
  },
  {
    value: "143. 千卒刺腹，五内如焚；芒刺在背，意马心猿。",
    explain: "受到攻击或者打击时，心急火燎，不能稳定心性。",
    description: "得此课者，多修心养性，静坐长思自己过，闲谈莫论他人非。",
    avoid: "朝三暮四。",
  },
  {
    value: "144.百酸搅肠。",
    explain: "恩人无义反为怨，百酸搅肠起风波。",
    description: "得此课者，静坐长思，修心养性，放下，才能承担。",
    avoid: "刻骨铭心。",
  },
  {
    value: "145.寸步难行。",
    explain: "连一步都难以进行。形容走路困难。也比喻处境艰难。",
    description: "得此课者，增加自身才能，多学多问，待机而动。",
    avoid: "听天由命。",
  },
  {
    value: "146.痴心妄想。",
    explain:
      "痴心：沉迷于某人或某事的心思；妄想：荒诞的打算。一心想着不可能实现的事。也指愚蠢荒唐的想法。",
    description: "得此课者，不要好高骛远，脚踏实地做事。必然梦想成真。",
    avoid: "痴人说梦。",
  },
  {
    value: "147. 船翻洋沟。",
    explain: "水能载舟亦能覆舟。",
    description:
      "得此课者，注意阴阳平衡，做事掌握尺度。谨慎小心，小心驶得万年船。",
    avoid: "不顾一切。",
  },
  {
    value: "148.青云得步。",
    explain:
      "青云：指青天；得步：直线上升。指迅速升到很高的地位，即指人一下子轻易登上很高的官位。",
    description: "得此课者，名利双收，发展开运之象。求财到手，谋事可成。",
    avoid: "不学无术。",
  },
  {
    value: "149. 难",
    explain: "时运不至费心多，时运不济苦难多。",
    description:
      "得此课者，忙忙碌碌难上难，某望求财苦无边。奋发图强，待机而动，鲤鱼化龙。大难不死必有后福之意。",
    avoid: "自暴自弃。",
  },
  {
    value: "150.虽莫轻狂，须开量，好鸟枝头亦朋友，落花水面皆文章。",
    explain:
      "虽然不太张扬狂妄，还是需要放开自己的度量，这样枝头的小鸟都能成为自己的朋友，花落在水面，激发了我的诗情画意。",
    description: "得此课者，成大业者，心胸豁达。交友广泛。低调谨慎。",
    avoid: "胡言乱语。",
  },
  {
    value:
      "151.人为万物灵，鬼为万物精，灵而弄精，精而弄灵，灵而不精，精而不灵。",
    explain: "菩提本无树，明镜亦非台，世间本无物，何处惹尘埃。",
    description:
      "得此课者，《道德经》一句--故常无，欲以观其妙。也可读，故，常无欲，以观其妙。此课就是玄之又玄，众妙之门。",
    avoid: "疑神疑鬼。",
  },
  {
    value: "152.堪愁堪优，大被蒙头，睡而不醒，醒而云游。",
    explain: "让人担忧，天天蒙头睡大觉，睡了叫不醒了，天天做白日梦。",
    description: "得此课者，早早醒悟，实际出发，洗心革面。能有收获。",
    avoid: "醉生梦死。",
  },
  {
    value: "153.穷通有命，富贵在天，南走北跑，尽是枉然。",
    explain:
      "贫穷还是富有，是上天都安排好的，穷富听重天命，不按着天命去走，走到哪里，都没有用。",
    description:
      "得此课者，古人说命里八字造就，这都是一种说法，如果说，我命由我不由天呢，其实都不是绝对，人生是穷通还是贫富，主导者是，天时、地利、人合、己合----缺一不可。",
    avoid: "随波逐流。",
  },
  {
    value: "154. 螟螣蟊贼，恶之不尽，秋扇见捐，孑然一身。",
    explain:
      "螟螣蟊贼，四种食苗的虫子，螟，吃苗芯；螣，食苗叶；蟊，吃苗根；贼，吃苗杆。秋扇见捐，秋凉以后，扇子就被抛在一边不用了。孑然一身，孤孤单单一个人。",
    description:
      "得此课者，人生遇到很多外界干扰，这都是在正常不过的事了，过去的事就是过去了，就像夏天的扇子，到了秋天以后，没人会想起他，远离这些干扰，独自成长自己。修缮自己，必会有所作为。",
    avoid: "同流合污。",
  },
  {
    value: "155.参居于西，商居于东，虽有方位，永不相逢。",
    explain:
      "古时候，人们把夜空中能看见的星星分为二十八组，称为“二十八宿（xiù）”，参（shēn）宿和心宿都是二十八宿之一。参宿也叫参星，在天空的西方；心宿的主星叫商星，又叫“大火”、“大辰”，在天空的东方。每当商星升起来时，参星已经落下去了，它们从不在天空中同时出现。这是怎么回事呢？参商二星，不会遇到一起，因此古代有个说法是'参商不相见’。",
    description: "得此课者，相濡与沫，不如相忘于江湖。",
    avoid: "念念不忘。",
  },
  {
    value: "156.竹本无心，多生枝节，藕虽有孔，不染垢尘。",
    explain:
      "竹子是空心，却能节外生枝。藕，虽然中间全是孔，在淤泥里泡着，内心却是干净的。",
    description:
      "得此课者，竹笋，嘴角皮厚腹中空，枝节多生，但实际用途很多，藕，是在恶劣环境下，能保持心性。静心而不染。",
    avoid: "出口伤人。",
  },
  {
    value: "157.囊内钱空，床头金尽，身居闹市，谁肯相近。",
    explain: "兜里没钱，家里也没钱。六亲无靠。",
    description:
      "得此课者，人情似纸张张薄，世事如棋局局新。贫居闹市无人问，富在深山有远亲。古人在闹市无人问的很多，伍子胥行乞，朱元璋化缘。姜太公算命。",
    avoid: "萎靡不振。",
  },
  {
    value: "158.鸡急奔树，狗急跳墙，今逢难事，切勿转相。",
    explain:
      "千万不要转变方向，这个意思就是对再难的事，态度一定要坚定，不能忽左忽右，静下心来，踏踏实实做好，不要鸡急了上树，狗急了跳墙。",
    description: "得此课者，遇事三思后行，稳住心性，缕清头绪。",
    avoid: "狗急跳墙。",
  },
  {
    value: "159. 能。",
    explain: "能，超出常人，能忍常人不能忍，能为常人不能为。",
    description:
      "得此课者，有很多事只要用点心，就都能做到。是个努力就有结果的好现象。",
    avoid: "见强就弱。",
  },
  {
    value: "160.山高水低，草烧花燃，人人吐火，树树冒烟。",
    explain: "干旱引起的火灾之象，牵连或者影响到到一些人或一些事物。",
    description:
      "得此课者，这是一个表象，并不是真正的有火灾发生了，而是得这一课，内在火太旺，如果此人水为忌用神，正好形成水火既济之卦象。反而因祸得福。凡是内在火旺之人，都是具有影响力的人。把握尺度，三思而后行，燃烧内在潜能，去完成自己的事业吧。",
    avoid: "不计后果。",
  },
  {
    value: "161. 风里烧烛，旱地拿鱼，血心虽有，名利却无。",
    explain:
      "在风里点蜡烛，很容易被熄灭；在旱地里捞鱼无法实现；但做这两件事，你却付出了心血和劳动。的最后什么也没得到。",
    description:
      "得此课者，不具备天时地利，做事很难成功，选择正确的方向再出发，这样成功几率会很高。",
    avoid: "一意孤行。",
  },
  {
    value: "162.天之生物，因才而笃，痴心妄想，天也难容。",
    explain:
      "前两句出自《中庸》，原文是'故天之生物，必因其才而笃焉’，德高望重的人一定会有相应的社会地位；金钱上一定是有保障的；一定会得到所有人的尊重；也一定会健康长寿。",
    description:
      "得此课者，注意修身、齐家。才能去做下一步，德不匹配，必遭灾殃，先提高自身能力，一步一步来。",
    avoid: "不学无术，自命才高。",
  },
  {
    value: "163.莫喜莫喜，始终无底，差之毫厘，谬之千里。",
    explain:
      "事情还没有明了，不要高兴太早。很可能一点点偏差，导致了最后结果差了千万里。",
    description: "得此课者，审时度势，谨言慎行。小心驶得万年船。",
    avoid: "马马虎虎。",
  },
  {
    value: "164.不揣其本，而齐其末，虽济然眉，恐遗后祸。",
    explain:
      "不去度量考虑它整体的位置，而只对齐他们的末端来比较，虽然能解决眼前的问题，但是恐怕会留下后患啊。解决问题不抓住实质，只看表面现象，随然能解决燃眉之急，恐怕将来还会有麻烦。",
    description: "得此课者，要抓住事物根本，不做表面文章。杜绝后患。",
    avoid: "敷衍了事。",
  },
  {
    value: "165. 夸父逐日，杞人忧天，心小气大，名利枉然。",
    explain:
      "夸父追日是个古老的故事，讲的是夸父想要追上太阳，但最后干渴而死。杞人忧天则是一个成语，说是春秋时期，杞国的一个人，担心天塌下来，并忧郁成疾。心胸没那么宽广，却总想着办大事，导致名利都成了一场空。",
    description: "得此课者，审时度势，量力而行。",
    avoid: "一意孤行。",
  },
  {
    value: "166. 刻舟求剑，刨腹藏珠，血心耿耿，名利虑虑。",
    explain:
      "刻舟求剑，一般比喻死守教条，拘泥成法，固执不知变通的意思。用静止的眼光来看待变化发展的事物，必将导致错误的判断。剖腹藏珠，破开肚子把珍珠藏进去。 比喻为物伤身，轻重颠倒。血心耿耿，形容忠心和执着。",
    description:
      "得此课者，忠心耿耿的去干一件表面的事，没有结果，得不到名利。不如脚踏实地，必有收获。",
    avoid: "固执己见",
  },
  {
    value: "167.为人谋何所图，断井颓垣，骨败而成匹夫，名利半点无。",
    explain:
      "断井颓垣，井：指井栏；垣：短墙。断了的井栏，倒塌的短墙。形容庭院破败的景象。'为人谋，何所图？成而赚坏骨，败而落匹夫。名利一点也无。’给别人谋划有什么好处？事成了落一个坏骨头的名声，事不成更成了有勇无谋的匹夫。”",
    description:
      "得此课者，在条件破败的环境下为别人出谋划策，事成则败坏了名声，事败，则更是一无所有。到头来名利两空，什么都没。",
    avoid: "反受其害。",
  },
  {
    value: "168.冰生于水，而寒于水，青出于蓝，而深于蓝。",
    explain: "长江后浪推前浪，一代更比一代强。",
    description: "得此课者，仕途，事业，家庭兴旺。一代强过一代。",
    avoid: "不务正业。",
  },
  {
    value: "169.可奈何，可奈何，中流见砥柱，平地起风波。",
    explain:
      "中流砥柱：黄河三门峡东的石山。就像屹立在黄河急流中的砥柱山一样。比喻在动荡环境能起支柱作用。 意思是：没办法绕过的障碍，?走在平地上，却无缘无故起了风波。无可奈何之象。",
    description:
      "得此课者，平地都起风浪。障碍太多。坚定信心，逢山开路，遇水架桥。",
    avoid: "惊弓之鸟。",
  },
  {
    value: "170.淄浥之滋味宜辨，泾渭之青浊当分，以待分辨不匀，惟恐乱乱纷纷。",
    explain:
      "指泾水和渭水，交汇处清浊难分，滋味难辨。喻很难辨别人品的优劣清浊，事物的真伪是非。要是分辨的不清楚，恐怕引起一些混乱或者错误。",
    description:
      "得此课者，多角度去审核人或者事物，分清真伪。避免有乱事在后边。",
    avoid: "偏听偏信。",
  },
  {
    value: "171.莫强求，莫强求，一薰一莸，十年尚尤有臭。",
    explain:
      "一薰一莸。yī xūn yī yóu出自-先秦左丘明《左传僖公四年》：一薰一莸，十年尚犹有臭。薰：香草，比喻善类；莸：臭草，比喻恶物。 薰莸混在一起，只闻到臭闻不到香。比喻善常被恶所掩盖。",
    description:
      "得此课者，事不可强求改变，善恶自有分清的一天。早晚会水落石出，真相大白。",
    avoid: "据理力争。",
  },
  {
    value: "172. 正而不足身安逸，邪而有余罹患囚。",
    explain:
      "（罹：lí 1、遭遇；遭受（灾祸或疾病）。 2、忧患；苦难。）好事没有太多，坏事很少，身心健康，相安无事。",
    description: "得此课者，与世无争，衣食无忧，身心健康。",
    avoid: "游手好闲。",
  },
  {
    value: "173.走韩卢而搏蹇兔。（韩卢：战国时期名犬）",
    explain:
      "韩，即战国时的韩国。卢，原意为黑色。韩国有黑色名犬，原以“韩卢”指代韩国名犬，这里就是指代“狗”。蹇jiǎn，跛，行走困难。整体的意思是狗追逐行走困难的兔子。比喻事物很容易做到，",
    description: "得此课者，简单易行，功到自然成。",
    avoid: "坐以待毙。",
  },
  {
    value: "174. 蜉蝣今夜落残花 。（蜉蝣：生命最短昆虫）",
    explain:
      "蜉蝣fú yóu的成虫体态轻盈,体色雅致,常在溪流、湖滩附近活动,成虫寿命很短的。“蜉蝣今夜落残花”意思是蜉蝣今夜就会在残花中坠落死亡。感叹蜉蝣一世,虽寿命不过朝夕,却也完整,令人羡慕不已。",
    description: "得此课者，相依相伴，终老一生。",
    avoid: "好吃懒做。",
  },
  {
    value: "175.鸡肋不足以安尊拳。",
    explain:
      "出自：《晋书·刘伶传》：'尝醉与俗人相忤，其人攘袂奋拳而往。伶徐日：鸡肋不足以安尊拳。其人笑而止。'意谓身体瘦弱，有如鸡肋，不堪一击。（鸡肋，鸡的肋骨，喻弱小者。）",
    description:
      "得此课者，第一身材魁梧，武将风范。第二手无缚鸡之力，身体弱小。",
    avoid: "倚强凌弱。",
  },
  {
    value: "176. 狗尾续貂。",
    explain:
      "司马炎封司马伦为赵王，掌管临漳。赵王司马伦篡位后，滥封官爵，貂尾不足，就用狗尾代替。因此，人们讥诮说：“貂不足，狗尾续。狗尾续貂：貂尾不够用了拿狗尾巴来顶替，指封官太滥。本为讽刺封爵太滥。“狗尾续貂”除了本来的意思，后来用来比喻以用不好的东西续在好东西的后面，前后两部分非常不相称，也用来比喻文章或办事能力拙。",
    description:
      "得此课者，意思很明白，做事要善始善终，有好的起点就要有好的结尾。",
    avoid: "得过且过。",
  },
  {
    value: "177.破竹折简。（砍竹遮笋，砍竹折笋）",
    explain:
      "出自-《幼学琼林》，意思是砍掉竹子去遮盖竹笋，多指爱情上不专一，或者对喜欢的事物不专一。砍竹遮笋，其旧迎新。",
    description:
      "得此课者，事物都有最终结果，过程长短而已。新旧更替不一定就是好事。勿以善小而不为，勿以恶小而为之。",
    avoid: "晨秦暮初。",
  },
  {
    value: "178. 罢罢罢。",
    explain: "罢，这个字古时候是疲劳、累的意思。",
    description: "得此课者，就是累、累、累的意思，",
    avoid: "疲惫不堪。",
  },
  {
    value: "179.有想",
    explain:
      "有，想，姜太公是把有和想结合最到位的一位名人，想要拥有的事物，一定自己日夜思念，才会变成现实，太公有很多事证明了，想了，才会有。",
    description:
      "得此课者，要有想法，要敢想，敢去做。光有想法，不去行动，那只能是想有，最后始终没有。",
    avoid: "夜梦金银。",
  },
  {
    value: "180.莫望。",
    explain: "别看了。",
    description: "得此课者，有很多事不该去看，看见了不应该看见的。就别说出去。",
    avoid: "口无遮拦。",
  },
  {
    value: "181. 即知轻重何必叮咛，可止则止，可行则行。",
    explain:
      "你自己是个识得大体的人，不需要过多嘱托，该行动的时候你会把握机会，不该做的事，自己会控制自己。",
    description: "得此课者，已经知道事情的轻重缓急，'可止则止，可行则行’。",
    avoid: "二人争路。",
  },
  {
    value: "182. 以卵击石",
    explain: "拿蛋去碰石头。比喻不估计自己的力量，自取灭亡。",
    description: "得此课者，衡量自己实力，增加自身能力。四两拨千斤。",
    avoid: "自不量力。",
  },
  {
    value: "183. 海底捞月",
    explain: "一轮明月照海中，只见影儿不见踪，痴人当财下去取，捞来捞去一场空。",
    description: "得此课者，选择错误，不会有结果，量力而行。",
    avoid: "执迷不悟。",
  },
  {
    value: "184. 景星入户",
    explain:
      "景星”本是吉祥的先兆，“景星入门”是好运、好景、好福气的预兆。预示你前途无量！前程似锦！",
    description: "得此课者，吉星高照，前程光明。",
    avoid: "得意忘形。",
  },
  {
    value: "185. 群蚁附膻",
    explain:
      "出自-先秦·庄周《庄子·徐无鬼》：“羊肉不慕蚁，蚁慕羊肉。羊肉，膻也。”附膻， fù shān羊肉的气味。 许多蚂蚁趋附羊肉。比喻许多臭味相投的人追求不好的事物。",
    description: "得此课者，人以群分，物以类聚，择其善者而从之。",
    avoid: "狐朋狗友。",
  },
  {
    value: "186. 李代桃僵。",
    explain:
      "李代桃僵，汉语成语，原比喻兄弟互相爱护互相帮助，后转用来比喻互相顶替或代人受过。在军事战略上为三十六计之一，指在敌我双方势均力敌，或者敌优我劣的情况下，用小的代价，换取大的胜利的谋略，类似象棋中的“舍车保帅”战术。",
    description: "得此课者，贵人相助，待机而动，必能成功。",
    avoid: "操之过急。",
  },
  {
    value: "187. 花发上林步步高，破壁飞去财源好。",
    explain:
      "花发上林是，乍暖还寒时候的早春景色，象征生机勃勃，雷电破壁，两龙乘云飞腾上天。",
    description:
      "得此课者，春暖花开，万物充满生机，墙壁上的龙经贵人点睛，雷电大作化为真龙，乘云上天之象，事业大成之意。",
    avoid: "白日做梦。",
  },
  {
    value: "188. 不敢说好，每朝画卯。",
    explain:
      "不敢说好不好，每天早晨点卯。画卯在古时，政府衙门，公职人员早晨记录签到词语。",
    description:
      "得此课者，政府衙门听差，官位可大可小，不敢轻易判断好不好，关键是不知道是大官还是小兵。",
    avoid: "不知深浅。",
  },
  {
    value: "189. 河清海宴。",
    explain: "河水清澈，大海平静，形容安然无事，天下太平，大吉大利。",
    description: "得此课者，盛世藏古董，乱世埋黄金。",
    avoid: "不思进取。",
  },
  {
    value: "190. 天下太平。",
    explain: "天下太平。盛世景象。",
    description: "得此课者，安居乐业，生意兴隆。",
    avoid: "玩物尚志。",
  },
  {
    value: "191. 明珠弹雀，绝无说好。",
    explain: "明珠弹雀，用珍珠打鸟雀。 比喻得到的补偿不了失去的。",
    description:
      "得此课者，有得不偿失之意象。另一方面是，比较奢侈，所以没人说好。",
    avoid: "大手大脚。",
  },
  {
    value: "192. 发物蒙尘，沧海遗珠。",
    explain:
      "发物蒙尘是指物品好久没人使用，物品上布满灰尘。沧海遗珠指大海里的珍珠被采珠人所遗漏。比喻埋没人才或被埋没的人才。",
    description: "得此课者，自身才能得不到施展，大才不得用。",
    avoid: "抑郁寡欢。",
  },
  {
    value: "193. 摧枝败叶，恶湿居下。",
    explain:
      "干枯的树枝，衰败的花叶。形容荒凉、破坏的样子。。恶湿居下，出自-《孟子.公孙丑上》：“今恶辱而居不仁，是犹恶湿而居下住。”厌恶潮湿却住在低洼的的地方。比喻行动跟愿望相违背。",
    description: "得此课者，很多事不如意。需要积极去改进。",
    avoid: "坐以待毙。",
  },
  {
    value: "194. 翻云复雨，一木撑天。",
    explain: "翻云复雨，形容人反复无常或惯于耍手段。一木能撑得住天。",
    description:
      "得此课者，两个意象，一个是翻手为云覆手为雨，有一定影响力，但力不从心，第二，反复无常，惯用手段。不长久。",
    avoid: "自不量力。",
  },
  {
    value: "195. 破麦剖梨。",
    explain:
      "破麦是磨麦子，意思是莲花破开了，莲子就露出来了，剖pōu，是分开的意思，古时候战乱时，一个妇人与丈夫儿子走散，做了一个梦，尼姑给解梦，”磨面，见夫面，莲花破而见子。”后来妇人果然见到了丈夫儿子。梦得到应验。",
    description: "得此课者，梦想成真之意。",
    avoid: "痴人说梦。",
  },
  {
    value: "196. 势若催枯，如汤沃雪。",
    explain:
      "强大势气应对弱小，意味不可抵挡。此刻形容气势很盛，就像去破坏枯烂的木头一样，如汤沃雪，是把热水倒在雪上，也是势不可挡之意，象意是十分的简单容易的就成功了。",
    description: "得此课者，有气势，有能力，做什么事都很简单易行，是个成功者。",
    avoid: "支持才高，目中无人。",
  },
  {
    value: "197. 摧枯拉朽。",
    explain:
      "出自-《晋书·甘卓传》：“将军之举武昌；若摧枯拉朽；何所顾虑乎？”枯、朽：枯草朽木。 摧折枯朽的草木。形容轻而易举。也比喻摧毁腐朽势力的强大气势。",
    description: "得此课者，做什么事都很容易成功。",
    avoid: "纸上谈兵。",
  },
  {
    value: "198. 锥处囊中，大器晚成。",
    explain:
      "出自-《史记·平原君虞卿列传》:“夫贤士之处世也，譬若锥之处囊中，其末立见。”囊：口袋。锥子放在口袋里，锥尖就会露出来。比喻有才能的人不会长久被埋没，终能显露头角",
    description: "得此课者，有才华的人很难掩盖自己，胸怀大志，大器晚成之象。",
    avoid: "玩物尚志。",
  },
  {
    value: "199. 物极必反，器满必倾。",
    explain:
      "物极必反，否极泰来，器满必倾，出自《荀子.宥yòu坐》：孔子观于鲁恒公之庙，有欹qī器焉，孔子问于守庙者曰：“此为何器？”守庙者曰：“此盖为宥坐之器，”孔子曰：“吾闻宥坐之器者，虚则欹，中则正，满则覆。”",
    description: "得此课者，不多不少正好，满招损谦受益，低调，谨言慎行。",
    avoid: "人前卖弄。",
  },
  {
    value: "200. 萋斐成锦，锦上添花。",
    explain: "萋斐成锦qi fei，花言巧语，罗织罪名，诬陷别人。",
    description:
      "得此课者，两个象意，第一花言巧语，添油加醋的诬陷别人。第二是被别人花言巧语，添油加醋的诬陷了。不管是谁，两者都需要谨言慎行，三缄其口。",
    avoid: "胡说八道。",
  },
  {
    value: "201. 城门失火，殃及池鱼。",
    explain:
      "城门失火，大家都到护城河取水，水用完了，鱼也死了。比喻无辜被连累而遭受灾祸。",
    description: "得此课者，第一要防备牵连自己，第二要注意，不要牵连别人。",
    avoid: "话多。",
  },
  {
    value: "202. 可叹可怜，花落庭间。",
    explain: "花落得满地，十分可怜，十分可惜。",
    description: "得此课者，可叹可怜，就是因为自己没得到。",
    avoid: "放不下。",
  },
  {
    value: "203. 有酒难酌,有膳难似,有气难堵,有话难言.",
    explain: "有美酒喝不到，有美餐吃不到。有气不能发泄，有话不能说。",
    description: "得此课者，受限严重。",
    avoid: "轻举妄动。",
  },
  {
    value: "204. 人既是鬼，鬼即是人，人能弄鬼,鬼能弄人.",
    explain: "都是人为操作，背后有人操作。耍钱鬼，赌博必有鬼。",
    description: "得此课者，谨言慎行，不要轻信他人。",
    avoid: "嗜赌如命。",
  },
  {
    value: "205. 苦思冥想，隔靴搔痒。",
    explain: "想来想去，也没有办法，不起作用。",
    description: "得此课者，自己想不通多找高人指点。",
    avoid: "百般思索。",
  },
  {
    value: "206. 既知不好，改弦易辙。",
    explain:
      "改弦易辙，车轮轧过的痕迹。琴换弦，车改道。比喻改变原来的方向、计划、办法等。",
    description:
      "得此课者，明知道不好，就马上改变方向。方向对了一切也就顺利了。",
    avoid: "顽固不化。",
  },
  {
    value: "207. 凡事当留余地，得意不可再往.",
    explain: "十分伶俐使七分，三分留着与儿孙，若要十分都使尽，远在儿孙身。",
    description: "得此课者，福不可享尽，便宜不可占尽，聪明不可用尽。",
    avoid: "占尽便宜。",
  },
  {
    value: "208. 庭前生瑞草，好事不如无。",
    explain: "好坏都是并存的。",
    description: "得此课者，有好事来的时候，随之麻烦事也一起来。",
    avoid: "一无是处。",
  },
  {
    value: "209. 事不由己。",
    explain: "自己说的不算。不能随心所欲。",
    description: "得此课者，事不由己，是吉凶各半，有时事不由己也是件好事。",
    avoid: "反客为主。",
  },
  {
    value: "210. 乱丝缠结，谁说有成。",
    explain: "乱丝缠结不见头，颠三倒四犯忧愁，慢行缓来头有序，急促反惹不自由。",
    description: "得此课者，稳住性情，慢慢解决烦乱的事，很快就能解决了。",
    avoid: "慌乱。",
  },
  {
    value: "211. 无可无不可，牵萝补屋，不即不离。",
    explain:
      "牵萝补屋， 拿藤萝补房屋的漏洞。比喻生活贫困，挪东补西。后多比喻将就凑合。不即不离，既不亲近也不疏远。",
    description:
      "得此课者，没有比这再好的了，没有什么贫富影响，一成不变的，什么都不在意。人生难得的红颜知己。",
    avoid: "破罐破摔。",
  },
  {
    value: "212. 自贻yí 伊yī 戚qī，自惹其祸.",
    explain:
      "《诗经》中有一首诗描写一个因公外出办事的官员恋家的故事：他在二月份被派往西方处理政事，在遥远的地方心里老是惦记家乡的亲人，从播种时节一直忙到收获季节还不能回家，心里堆积着无限的烦恼。 都是自己找的。",
    description:
      "得此课者，不能回家，没有什么祸，意思是不能回家是因为公务在身，是自己原因造成的。",
    avoid: "闷闷不乐。",
  },
  {
    value: "213. 不必。",
    explain: "就是大可不必。",
    description: "得此课者，没有什么好与坏一说，没有必要。",
    avoid: "穷追不舍。",
  },
  {
    value: "214. 好，好。",
    explain: "两个好，是代表不是一般的好。",
    description: "得此课者，一切顺利，好人相助。",
    avoid: "好色。",
  },
  {
    value: "215. 莫说富贵在天,穷通有命,亦需行尽人事,以听天命",
    explain:
      "不管是好命还是坏命，好命也需要谨言慎行，高调做事低调做人，坏命也必须发愤图强，不要懈怠。持之以恒。否极泰来。",
    description:
      "得此课者，福地福人居，福人居福地。好与坏完全取决于个人后天努力。",
    avoid: "听天由命。",
  },
];
